Repository: view-io/personal
Catalog: src/View.Personal/Resources/Strings.*.resx
Languages: de, es, fr, hi, ja, ko, pt, zh_cn

# AppTitle
source: View Personal
es: Vista Personal
fr: Voir Personnel
hi: व्यू पर्सनल
ja: パーソナルを見る
ko: 개인 Vista
zh_cn: 查看个人

source: Knowledgebase
de: Wissensdatenbank
es: Base de conocimiento
fr: Base de connaissances
hi: ज्ञान आधार
ja: ナレッジベース
ko: 지식 베이스
pt: Base de Conhecimento
zh_cn: 知识库

source: Settings
de: Einstellungen
es: Configuración
fr: Paramètres
hi: सेटिंग्स
ja: 設定
ko: 설정
pt: Configurações
zh_cn: 设置

source: Language
de: Sprache
es: Idioma
fr: Langue
hi: भाषा
ja: 言語
ko: 언어
pt: Idioma
zh_cn: 语言

source: English
de: Englisch
es: Inglés
fr: Anglais
hi: अंग्रेज़ी
ja: 英語
ko: 영어
pt: Inglês
zh_cn: 英语

source: Hindi
hi: हिंदी
ja: ヒンディー語
ko: 힌디어
zh_cn: 印地语

source: Save Settings
de: Einstellungen speichern
es: Guardar configuración
fr: Enregistrer les paramètres
hi: सेटिंग्स सहेजें
ja: 設定を保存
ko: 설정 저장
pt: Salvar Configurações
zh_cn: 保存设置

# ErrorStartingApp
source: Unable to start View Personal
de: View Personal konnte nicht gestartet werden
es: No se pudo iniciar Vista Personal
fr: Impossible de démarrer Voir Personnel
hi: व्यू पर्सनल शुरू करने में असमर्थ
ja: パーソナルを見る を起動できません
ko: 개인 Vista를 시작하지 못했습니다
pt: Não foi possível iniciar o View Personal
zh_cn: 无法启动 查看个人

# ErrorGeneric
source: An error occurred
de: Ein Fehler ist aufgetreten
es: Ocurrió un error
fr: Une erreur s'est produite
hi: एक त्रुटि हुई
ja: エラーが発生しました
ko: 오류가 발생했습니다
pt: Ocorreu um erro
zh_cn: 发生错误

# SettingsSaved
source: Settings saved successfully
de: Einstellungen erfolgreich gespeichert
es: Configuración guardada correctamente
fr: Paramètres enregistrés avec succès
hi: सेटिंग्स सफलतापूर्वक सहेजी गईं
ja: 設定が正常に保存されました
ko: 설정이 성공적으로 저장되었습니다
pt: Configurações salvas com sucesso
zh_cn: 设置保存成功

# LanguageChanged
source: Language changed to {0}
de: Sprache auf {0} geändert
es: Idioma cambiado a {0}
fr: Langue changée en {0}
hi: भाषा बदलकर {0} कर दी गई
ja: 言語が{0}に変更されました
ko: 언어가 {0}(으)로 변경되었습니다
pt: Idioma alterado para {0}
zh_cn: 语言已更改为 {0}

source: Start New Chat
de: Neuen Chat starten
es: Iniciar nuevo chat
fr: Démarrer une nouvelle discussion
hi: नई चैट शुरू करें
ja: 新しいチャットを開始
ko: 새 채팅 시작
pt: Iniciar Novo Chat
zh_cn: 开始新对话

# OpenAIProvider
source: OpenAI
hi: ओपनएआई
zh_cn: 开放人工智能

# OpenAIDescription
source: Gain access to OpenAI models
de: Erhalten Sie Zugriff auf OpenAI-Modelle
es: Obtenga acceso a los modelos de OpenAI
fr: Accédez aux modèles OpenAI
hi: ओपनएआई मॉडल तक पहुंच प्राप्त करें
ja: OpenAIモデルにアクセスします
ko: OpenAI 모델에 액세스하세요
pt: Obtenha acesso aos modelos da OpenAI
zh_cn: 获取 开放人工智能 模型的访问权限

source: OpenAI Settings
de: OpenAI-Einstellungen
es: Configuración de OpenAI
fr: Paramètres OpenAI
hi: ओपनएआई सेटिंग्स
ja: OpenAI 設定
ko: OpenAI 설정
pt: Configurações da OpenAI
zh_cn: 开放人工智能 设置

source: OpenAI API Key
de: OpenAI-API-Schlüssel
es: Clave de API de OpenAI
fr: Clé d'API OpenAI
hi: ओपनएआई एपीआई कुंजी
ja: OpenAI APIキー
ko: OpenAI API 키
pt: Chave de API da OpenAI
zh_cn: 开放人工智能 应用程序编程接口 密钥

source: OpenAI Completion Model
de: OpenAI-Vervollständigungsmodell
es: Modelo de completado de OpenAI
fr: Modèle de complétion OpenAI
hi: ओपनएआई पूर्णता मॉडल
ja: OpenAI 補完モデル
ko: OpenAI 완료 모델
pt: Modelo de Conclusão da OpenAI
zh_cn: 开放人工智能 完成模型

source: System Prompt
de: System-Anweisung
es: Prompt del sistema
fr: Invite système
hi: सिस्टम प्रॉम्प्ट
ja: システムプロンプト
ko: 시스템 프롬프트
pt: Prompt do Sistema
zh_cn: 系统提示

source: OpenAI Endpoint
de: OpenAI-Endpunkt
es: Endpoint de OpenAI
fr: Point de terminaison OpenAI
hi: ओपनएआई एंडपॉइंट
ja: OpenAI エンドポイント
ko: OpenAI 엔드포인트
pt: Endpoint da OpenAI
zh_cn: 开放人工智能 端点

source: Batch Size
de: Batch-Größe
es: Tamaño del lote
fr: Taille du lot
hi: बैच आकार
ja: バッチサイズ
ko: 배치 크기
pt: Tamanho do Lote
zh_cn: 批处理大小

source: Max Retries
de: Max. Wiederholungen
es: Máximo de reintentos
fr: Tentatives max.
hi: अधिकतम पुनः प्रयास
ja: 最大リトライ回数
ko: 최대 재시도 횟수
pt: Máximo de Tentativas
zh_cn: 最大重试次数

source: Temperature
de: Temperatur
es: Temperatura
fr: Température
hi: तापमान
ko: 온도
pt: Temperatura
zh_cn: 温度

source: Enable RAG
de: RAG aktivieren
es: Habilitar RAG
fr: Activer le RAG
hi: RAG सक्षम करें
ja: RAGを有効にする
ko: RAG 활성화
pt: Ativar RAG
zh_cn: 启用 RAG

source: Advanced Settings
de: Erweiterte Einstellungen
es: Configuración avanzada
fr: Paramètres avancés
hi: उन्नत सेटिंग्स
ja: 詳細設定
ko: 고급 설정
pt: Configurações Avançadas
zh_cn: 高级设置

source: Similarity Threshold
de: Ähnlichkeitsschwellenwert
es: Umbral de similitud
fr: Seuil de similarité
hi: समानता सीमा
ja: 類似度のしきい値
ko: 유사도 임계값
pt: Limiar de Similaridade
zh_cn: 相似度阈值

# AnthropicProvider
source: Anthropic
hi: एंथ्रोपिक
zh_cn: 人择

# AnthropicDescription
source: Gain access to Anthropic models
de: Erhalten Sie Zugriff auf Anthropic-Modelle
es: Obtenga acceso a los modelos de Anthropic
fr: Obtenez l'accès aux modèles Anthropic
hi: एंथ्रोपिक मॉडल तक पहुंच प्राप्त करें
ja: Anthropicモデルへのアクセスを取得
ko: Anthropic 모델에 액세스하세요
pt: Obtenha acesso aos modelos da Anthropic
zh_cn: 获取 人择 模型的访问权限

source: Anthropic Settings
de: Anthropic-Einstellungen
es: Configuración de Anthropic
fr: Paramètres Anthropic
hi: एंथ्रोपिक सेटिंग्स
ja: Anthropic 設定
ko: Anthropic 설정
pt: Configurações da Anthropic
zh_cn: 人择 设置

source: Anthropic API Key
de: Anthropic-API-Schlüssel
es: Clave de API de Anthropic
fr: Clé d'API Anthropic
hi: एंथ्रोपिक एपीआई कुंजी
ja: Anthropic APIキー
ko: Anthropic API 키
pt: Chave de API da Anthropic
zh_cn: 人择 应用程序编程接口 密钥

source: Anthropic Completion Model
de: Anthropic-Vervollständigungsmodell
es: Modelo de completado de Anthropic
fr: Modèle de complétion Anthropic
hi: एंथ्रोपिक पूर्णता मॉडल
ja: Anthropic 補完モデル
ko: Anthropic 완료 모델
pt: Modelo de Conclusão da Anthropic
zh_cn: 人择 完成模型

source: Anthropic Endpoint
de: Anthropic-Endpunkt
es: Endpoint de Anthropic
fr: Point de terminaison Anthropic
hi: एंथ्रोपिक एंडपॉइंट
ja: Anthropic エンドポイント
ko: Anthropic 엔드포인트
pt: Endpoint da Anthropic
zh_cn: 人择 端点

# LocalProvider
source: Local
de: Lokal
hi: स्थानीय
ja: ローカル
ko: 로컬
zh_cn: 本地

# LocalDescription
source: Gain access to a local model
de: Erhalten Sie Zugriff auf lokale Modelle
es: Obtenga acceso a los modelos locales
fr: Accédez aux modèles locaux
hi: स्थानीय मॉडल तक पहुंच प्राप्त करें
ja: ローカルモデルにアクセスします
ko: 로컬 모델에 액세스하세요
pt: Obtenha acesso a modelos locais
zh_cn: 获取本地模型的访问权限

source: Ollama Settings
de: Ollama-Einstellungen
es: Configuración de Ollama
fr: Paramètres Ollama
hi: ओलामा सेटिंग्स
ja: Ollama 設定
ko: Ollama 설정
pt: Configurações do Ollama
zh_cn: 奥拉马 设置

source: Ollama Completion Model
de: Ollama-Vervollständigungsmodell
es: Modelo de completado de Ollama
fr: Modèle de complétion Ollama
hi: ओलामा पूर्णता मॉडल
ja: Ollama 補完モデル
ko: Ollama 완료 모델
pt: Modelo de Conclusão do Ollama
zh_cn: 奥拉马 完成模型

source: View AI Enterprise Settings
es: Ver la configuración empresarial de IA
ja: AI エンタープライズ設定の表示
ko: AI Enterprise 설정 보기
pt: Ver configurações do AI Enterprise
zh_cn: 查看AI企业设置

source: Embeddings API Key
de: Embeddings-API-Schlüssel
es: Clave de API de Embeddings
fr: Clé d'API d'embeddings
hi: एम्बेडिंग्स एपीआई कुंजी
ja: 埋め込みAPIキー
ko: 임베딩 API 키
pt: Chave de API de Embeddings
zh_cn: 嵌入 应用程序编程接口 密钥

source: View Endpoint
de: View-Endpunkt
es: Endpoint de View
fr: Point de terminaison View
hi: व्यू एंडपॉइंट
ja: View エンドポイント
ko: 보기 엔드포인트
pt: Endpoint do View
zh_cn: View 端点

source: Ollama Host Name
es: Nombre de host de Ollama
fr: Nom d'hôte Ollama
hi: ओलामा होस्ट नाम
ja: Ollama ホスト名
ko: Ollama 호스트 이름
pt: Nome do Host do Ollama
zh_cn: 奥拉马 主机名

source: Access Key
de: Zugriffsschlüssel
es: Clave de acceso
fr: Clé d'accès
hi: एक्सेस कुंजी
ja: アクセスキー
ko: 액세스 키
pt: Chave de Acesso
zh_cn: 访问密钥

source: Tenant Guid
de: Mandanten-GUID
es: GUID del inquilino
fr: GUID du locataire
hi: टेनेंट जीयूआईडी
ja: テナントGUID
ko: 테넌트 GUID
pt: GUID do Inquilino
zh_cn: 租户 GUID

source: Knowledgebase Source
de: Quelle der Wissensdatenbank
es: Origen de la base de conocimiento
fr: Source de la base de connaissances
hi: ज्ञानआधार स्रोत
ja: ナレッジベースソース
ko: 지식 베이스 소스
pt: Fonte da Base de Conhecimento
zh_cn: 知识库源

source: Completion Model
de: Vervollständigungsmodell
es: Modelo de completado
fr: Modèle de complétion
hi: पूर्णता मॉडल
ja: 補完モデル
ko: 완료 모델
pt: Modelo de Conclusão
zh_cn: 完成模型

source: Max retrieved
de: Max. abgerufene
es: Máximo recuperado
fr: Max récupérés
hi: अधिकतम पुनर्प्राप्त
ja: 最大取得数
ko: 최대 검색 수
pt: Máximo recuperado
zh_cn: 最大检索数

source: Query optimization
de: Abfrageoptimierung
es: Optimización de consultas
fr: Optimisation de la requête
hi: क्वेरी अनुकूलन
ja: クエリ最適化
ko: 쿼리 최적화
pt: Otimização de consulta
zh_cn: 查询优化

source: Simplified Chinese
de: Vereinfachtes Chinesisch
es: Chino simplificado
fr: Chinois simplifié
hi: सरलीकृत चीनी
ja: 簡体字中国語
ko: 중국어 간체
pt: Chinês Simplificado
zh_cn: 简体中文

# EnableContextSortingTooltip
source: Sort context by relevance
de: Kontext nach Relevanz sortieren
es: Ordenar contexto por relevancia
fr: Trier le contexte par pertinence
hi: प्रासंगिकता के अनुसार संदर्भ को क्रमबद्ध करें
ja: コンテキストを関連性で並べ替える
ko: 관련성에 따라 컨텍스트 정렬
pt: Ordenar contexto por relevância
zh_cn: 按相关性排序上下文

# EnableRAGTooltip
source: Enable Retrieval Augmented Generation. When enabled, the AI will use your knowledge base to augment its responses.
de: Retrieval Augmented Generation aktivieren. Wenn aktiviert, verwendet die KI Ihre Wissensdatenbank, um ihre Antworten zu erweitern.
es: Habilitar la Generación Aumentada por Recuperación (RAG). Cuando está habilitada, la IA utilizará su base de conocimiento para aumentar sus respuestas.
fr: Activer la Génération Augmentée par Récupération (RAG). Lorsque cette option est activée, l'IA utilisera votre base de connaissances pour enrichir ses réponses.
hi: पुनर्प्राप्ति संवर्धित जनरेशन सक्षम करें। जब सक्षम किया जाता है, तो एआई अपनी प्रतिक्रियाओं को बढ़ाने के लिए आपके ज्ञान आधार का उपयोग करेगा।
ja: 検索拡張生成 (RAG) を有効にします。有効にすると、AI はナレッジベースを使用して応答を拡張します。
ko: 검색 증강 생성(RAG)을 활성화합니다. 활성화하면 AI가 지식 베이스를 사용하여 응답을 보강합니다.
pt: Ativar Geração Aumentada por Recuperação (RAG). Quando ativado, a IA usará sua base de conhecimento para aumentar suas respostas.
zh_cn: 启用检索增强生成。启用后，AI 将使用您的知识库来增强其响应。

# ConfigureAdvancedRAGTooltip
source: Configure advanced RAG settings
de: Erweiterte RAG-Einstellungen konfigurieren
es: Configurar los ajustes avanzados de RAG
fr: Configurer les paramètres RAG avancés
hi: उन्नत RAG सेटिंग्स कॉन्फ़िगर करें
ja: 高度なRAG設定を構成
ko: 고급 RAG 설정 구성
pt: Configurar definições avançadas de RAG
zh_cn: 配置高级 RAG 设置

# MaxDocumentsToRetrieveTooltip
source: Maximum number of documents to retrieve
de: Maximale Anzahl abzurufender Dokumente
es: Número máximo de documentos a recuperar
fr: Nombre maximum de documents à récupérer
hi: पुनर्प्राप्त करने के लिए दस्तावेज़ों की अधिकतम संख्या
ja: 取得するドキュメントの最大数
ko: 검색할 최대 문서 수
pt: Número máximo de documentos a serem recuperados
zh_cn: 要检索的文档最大数量

source: RAG Settings
de: RAG-Einstellungen
es: Configuración de RAG
fr: Paramètres RAG
hi: RAG सेटिंग्स
ja: RAG設定
ko: RAG 설정
pt: Configurações de RAG
zh_cn: RAG 设置

# EmbeddingsGenerationDescription
source: Select the local or cloud provider embedding model to be used to generate vector embeddings.
de: Wählen Sie das lokale oder Cloud-Anbieter-Embedding-Modell aus, das zur Erzeugung von Vektor-Embeddings verwendet werden soll.
es: Seleccione el proveedor local o en la nube del modelo de embedding que se utilizará para generar embeddings vectoriales.
fr: Sélectionnez le modèle d'embedding, local ou cloud, à utiliser pour générer des embeddings vectoriels.
hi: स्थानीय या क्लाउड प्रदाता चुनें एम्बेडिंग मॉडल का उपयोग किया जाएगा वेक्टर एम्बेडिंग्स उत्पन्न करने के लिए।
ja: ベクトル埋め込みの生成に使用する ローカルまたはクラウドプロバイダーの 埋め込みモデルを選択します。
ko: 벡터 임베딩을 생성하는 데 사용할 로컬 또는 클라우드 임베딩 모델 제공업체를 선택하세요.
pt: Selecione o modelo de embedding do provedor local ou em nuvem a ser usado para gerar embeddings de vetores.
zh_cn: 选择用于生成向量嵌入的 本地或云提供商嵌入模型。

# EmbeddingsGenerationWarning
source: WARNING: If you update or change your embedding model, you will need to re-import all documents.
de: WARNUNG: Wenn Sie Ihr Embedding-Modell aktualisieren oder ändern, müssen Sie alle Dokumente erneut importieren.
es: ADVERTENCIA: Si actualiza o cambia su modelo de embedding, deberá reimportar todos los documentos.
fr: AVERTISSEMENT : Si vous mettez à jour ou changez votre modèle d'embedding, vous devrez réimporter tous les documents.
hi: चेतावनी: यदि आप अपडेट या बदलते हैं आपका एम्बेडिंग मॉडल, आपको सभी दस्तावेज़ों को फिर से आयात करना होगा।
ja: 警告：埋め込みモデルを更新または 変更した場合、すべてのドキュメントを 再インポートする必要があります。
ko: 경고: 임베딩 모델을 업데이트하거나 변경하는 경우 모든 문서를 다시 가져와야 합니다.
pt: AVISO: Se você atualizar ou alterar seu modelo de embedding, precisará reimportar todos os documentos.
zh_cn: 警告：如果您更新或更改 嵌入模型，您需要 重新导入所有文档。

source: Model Name
de: Modellname
es: Nombre del modelo
fr: Nom du modèle
hi: मॉडल नाम
ja: モデル名
ko: 모델 이름
pt: Nome do Modelo
zh_cn: 模型名称

source: Dimensionality
de: Dimensionalität
es: Dimensionalidad
fr: Dimensionalité
hi: आयामिता
ja: 次元数
ko: 차원성
pt: Dimensionalidade
zh_cn: 维度

source: Max Tokens
es: Máximo de tokens
fr: Jetons max.
hi: अधिकतम टोकन
ja: 最大トークン数
ko: 최대 토큰
pt: Máximo de Tokens
zh_cn: 最大令牌数

# GainAccessToAnthropic
source: Gain access to Anthropic models
de: Erhalten Sie Zugriff auf Anthropic-Modelle
es: Obtenga acceso a los modelos de Anthropic
fr: Obtenez l'accès aux modèles Anthropic
hi: एंथ्रोपिक मॉडल तक पहुंच प्राप्त करें
ja: Anthropicモデルへのアクセスを取得
ko: Anthropic 모델에 액세스하세요
pt: Obtenha acesso aos modelos da Anthropic
zh_cn: 获取 人择 模型的访问权限

# GainAccessToLocalModel
source: Gain access to a local model.
de: Erhalten Sie Zugriff auf ein lokales Modell.
es: Obtenga acceso a un modelo local.
fr: Obtenez l'accès à un modèle local.
hi: स्थानीय मॉडल तक पहुंच प्राप्त करें।
ja: ローカルモデルへのアクセスを取得します。
ko: 로컬 모델에 액세스하세요.
pt: Obtenha acesso a um modelo local.
zh_cn: 获取本地模型的访问权限。

# GainAccessToViewModel
source: Gain access to View models
de: Erhalten Sie Zugriff auf View-Modelle
es: Obtenga acceso a los modelos de View
fr: Obtenez l'accès aux modèles View
hi: व्यू मॉडल तक पहुंच प्राप्त करें
ja: Viewモデルへのアクセスを取得
ko: View 모델에 액세스하세요
pt: Obtenha acesso aos modelos do View
zh_cn: 获取 View 模型的访问权限

source: Language Setting Saved
de: Spracheinstellung gespeichert
es: Configuración de idioma guardada
fr: Paramètre de langue enregistré
hi: भाषा सेटिंग सहेजी गई
ja: 言語設定が保存されました
ko: 언어 설정 저장됨
pt: Configuração de Idioma Salva
zh_cn: 语言设置已保存

source: Error
de: Fehler
fr: Erreur
hi: त्रुटि
ja: エラー
ko: 오류
pt: Erro
zh_cn: 错误

# FailedToSaveLanguage
source: Failed to save language setting
de: Fehler beim Speichern der Spracheinstellung
es: Error al guardar la configuración de idioma
fr: Échec de l'enregistrement du paramètre de langue
hi: भाषा सेटिंग सहेजने में विफल
ja: 言語設定の保存に失敗しました
ko: 언어 설정 저장 실패
pt: Falha ao salvar a configuração de idioma
zh_cn: 保存语言设置失败

# PleaseEnterValueFor
source: Please enter value for the {0}.
de: Bitte geben Sie einen Wert für {0} ein.
es: Por favor, ingrese un valor para {0}.
fr: Veuillez saisir une valeur pour le {0}.
hi: कृपया {0} के लिए मान दर्ज करें।
ja: {0}の値を入力してください。
ko: {0}에 대한 값을 입력해주세요.
pt: Por favor, insira um valor para o(a) {0}.
zh_cn: 请输入 {0} 的值。

source: Ollama Not Installed
de: Ollama nicht installiert
es: Ollama no está instalado
fr: Ollama non installé
hi: ओलामा स्थापित नहीं है
ja: Ollamaがインストールされていません
ko: Ollama가 설치되지 않았습니다
pt: Ollama Não Instalado
zh_cn: 奥拉马 未安装

# OllamaNotRunning
source: Ollama is not installed or not running on the system defined in the settings.
de: Ollama ist nicht installiert oder läuft nicht auf dem in den Einstellungen definierten System.
es: Ollama no está instalado o no se está ejecutando en el sistema definido en la configuración.
fr: Ollama n'est pas installé ou ne fonctionne pas sur le système défini dans les paramètres.
hi: ओलामा सेटिंग्स में परिभाषित सिस्टम पर स्थापित नहीं है या चल नहीं रहा है।
ja: Ollamaがインストールされていないか、設定で定義されたシステムで実行されていません。
ko: Ollama가 설치되지 않았거나 설정에 정의된 시스템에서 실행되고 있지 않습니다.
pt: Ollama não está instalado ou não está em execução no sistema definido nas configurações.
zh_cn: 奥拉马 未安装或未在设置中定义的系统上运行。

source: Download Ollama
de: Ollama herunterladen
es: Descargar Ollama
fr: Télécharger Ollama
hi: ओलामा डाउनलोड करें
ja: Ollamaをダウンロード
ko: Ollama 다운로드
pt: Baixar Ollama
zh_cn: 下载 奥拉马

source: File Deleted
de: Datei gelöscht
es: Archivo eliminado
fr: Fichier supprimé
hi: फ़ाइल हटा दी गई
ja: ファイルが削除されました
ko: 파일이 삭제되었습니다
pt: Arquivo Excluído
zh_cn: 文件已删除

# FileDeletedSuccess
source: {0} was deleted successfully!
de: {0} wurde erfolgreich gelöscht!
es: ¡{0} se eliminó correctamente!
fr: {0} a été supprimé avec succès !
hi: {0} सफलतापूर्वक हटा दिया गया!
ja: {0} は正常に削除されました！
ko: {0}이(가) 성공적으로 삭제되었습니다!
pt: {0} foi excluído com sucesso!
zh_cn: {0} 删除成功！

source: Deletion Error
de: Löschfehler
es: Error de eliminación
fr: Erreur de suppression
hi: हटाने में त्रुटि
ja: 削除エラー
ko: 삭제 오류
pt: Erro na Exclusão
zh_cn: 删除错误

source: Deletion Warning
de: Löschwarnung
es: Advertencia de eliminación
fr: Avertissement de suppression
hi: हटाने की चेतावनी
ja: 削除警告
ko: 삭제 경고
pt: Aviso de Exclusão
zh_cn: 删除警告

source: Files Deleted
de: Dateien gelöscht
es: Archivos eliminados
fr: Fichiers supprimés
hi: फ़ाइलें हटा दी गईं
ja: ファイルが削除されました
ko: 파일 삭제됨
pt: Arquivos Excluídos
zh_cn: 文件已删除

source: Ingestion Error
de: Aufnahmefehler
es: Error de ingesta
fr: Erreur d'ingestion
hi: अंतर्ग्रहण त्रुटि
ja: 取り込みエラー
ko: 수집 오류
pt: Erro na Ingestão
zh_cn: 摄取错误

source: No file selected.
de: Keine Datei ausgewählt.
es: Ningún archivo seleccionado.
fr: Aucun fichier sélectionné.
hi: कोई फ़ाइल चयनित नहीं।
ja: ファイルが選択されていません。
ko: 선택된 파일이 없습니다.
pt: Nenhum arquivo selecionado.
zh_cn: 未选择文件。

source: File Ingested
de: Datei aufgenommen
es: Archivo procesado
fr: Fichier ingéré
hi: फ़ाइल अंतर्ग्रहित
ja: ファイルが取り込まれました
ko: 파일 수집됨
pt: Arquivo Ingerido
zh_cn: 文件已摄取

# FileIngestedSuccess
source: {0} ingested successfully!
de: {0} erfolgreich aufgenommen!
es: ¡{0} se procesó correctamente!
fr: {0} a été ingéré avec succès !
hi: {0} सफलतापूर्वक अंतर्ग्रहित!
ja: {0} は正常に取り込まれました！
ko: {0}이(가) 성공적으로 수집되었습니다!
pt: {0} ingerido com sucesso!
zh_cn: {0} 摄取成功！

source: Re-ingestion Error
de: Fehler bei der erneuten Aufnahme
es: Error de re-ingesta
fr: Erreur de réingestion
hi: पुन: अंतर्ग्रहण त्रुटि
ja: 再取り込みエラー
ko: 재수집 오류
pt: Erro na Re-ingestão
zh_cn: 重新摄取错误

source: Batch Ingestion Complete
de: Stapelaufnahme abgeschlossen
es: Ingesta por lotes completada
fr: Ingestion par lot terminée
hi: बैच अंतर्ग्रहण पूर्ण
ja: バッチ取り込み完了
ko: 배치 수집 완료
pt: Ingestão em Lote Concluída
zh_cn: 批量摄取完成

source: Batch Ingestion Error
de: Fehler bei der Stapelaufnahme
es: Error en la ingesta por lotes
fr: Erreur d'ingestion par lot
hi: बैच अंतर्ग्रहण त्रुटि
ja: バッチ取り込みエラー
ko: 배치 수집 오류
pt: Erro na Ingestão em Lote
zh_cn: 批量摄取错误

source: Ingestion Cancelled
de: Aufnahme abgebrochen
es: Ingesta cancelada
fr: Ingestion annulée
hi: अंतर्ग्रहण रद्द किया गया
ja: 取り込みがキャンセルされました
ko: 수집 취소됨
pt: Ingestão Cancelada
zh_cn: 摄取已取消

# FilePathNotAvailable
source: File path is not available.
de: Dateipfad ist nicht verfügbar.
es: La ruta del archivo no está disponible.
fr: Le chemin du fichier n'est pas disponible.
hi: फ़ाइल पथ उपलब्ध नहीं है।
ja: ファイルパスが利用できません。
ko: 파일 경로를 사용할 수 없습니다.
pt: O caminho do arquivo não está disponível.
zh_cn: 文件路径不可用。

# FileDoesNotExist
source: File does not exist on disk.
de: Datei existiert nicht auf der Festplatte.
es: El archivo no existe en el disco.
fr: Le fichier n'existe pas sur le disque.
hi: फ़ाइल डिस्क पर मौजूद नहीं है।
ja: ファイルがディスクに存在しません。
ko: 파일이 디스크에 존재하지 않습니다.
pt: O arquivo não existe no disco.
zh_cn: 文件在磁盘上不存在。

# CouldNotOpenFileLocation
source: Could not open file location: {0}
de: Dateispeicherort konnte nicht geöffnet werden: {0}
es: No se pudo abrir la ubicación del archivo: {0}
fr: Impossible d'ouvrir l'emplacement du fichier : {0}
hi: फ़ाइल स्थान नहीं खोल सका: {0}
ja: ファイルの場所を開けませんでした: {0}
ko: 파일 위치를 열 수 없습니다: {0}
pt: Não foi possível abrir o local do arquivo: {0}
zh_cn: 无法打开文件位置：{0}

# FilePathNotAvailableForReprocessing
source: File path is not available for reprocessing.
de: Dateipfad ist für die Neuverarbeitung nicht verfügbar.
es: La ruta del archivo no está disponible para reprocesar.
fr: Le chemin du fichier n'est pas disponible pour le retraitement.
hi: पुनः प्रसंस्करण के लिए फ़ाइल पथ उपलब्ध नहीं है।
ja: 再処理のためのファイルパスが利用できません。
ko: 재처리를 위한 파일 경로를 사용할 수 없습니다.
pt: O caminho do arquivo não está disponível para reprocessamento.
zh_cn: 文件路径不可用于重新处理。

source: File Reprocessed
de: Datei neu verarbeitet
es: Archivo reprocesado
fr: Fichier retraité
hi: फ़ाइल पुनः प्रसंस्करित
ja: ファイルが再処理されました
ko: 파일 재처리됨
pt: Arquivo Reprocessado
zh_cn: 文件已重新处理

# FileReprocessedSuccess
source: {0} was reprocessed successfully!
de: {0} wurde erfolgreich neu verarbeitet!
es: ¡{0} se reprocesó correctamente!
fr: {0} a été retraité avec succès !
hi: {0} सफलतापूर्वक पुनः प्रसंस्करित किया गया!
ja: {0} は正常に再処理されました！
ko: {0}이(가) 성공적으로 재처리되었습니다!
pt: {0} foi reprocessado com sucesso!
zh_cn: {0} 重新处理成功！

source: Knowledgebase Deleted
de: Wissensdatenbank gelöscht
es: Base de conocimiento eliminada
fr: Base de connaissances supprimée
hi: ज्ञानआधार हटा दिया गया
ja: ナレッジベースが削除されました
ko: 지식 베이스 삭제됨
pt: Base de Conhecimento Excluída
zh_cn: 知识库已删除

# KnowledgebaseDeletedSuccess
source: {0} was deleted successfully!
de: {0} wurde erfolgreich gelöscht!
es: ¡{0} se eliminó correctamente!
fr: {0} a été supprimée avec succès !
hi: {0} सफलतापूर्वक हटा दिया गया!
ja: {0} は正常に削除されました！
ko: {0}이(가) 성공적으로 삭제되었습니다!
pt: {0} foi excluída com sucesso!
zh_cn: {0} 删除成功！

source: Model Deleted
de: Modell gelöscht
es: Modelo eliminado
fr: Modèle supprimé
hi: मॉडल हटा दिया गया
ja: モデルが削除されました
ko: 모델 삭제됨
pt: Modelo Excluído
zh_cn: 模型已删除

# ModelDeletedSuccess
source: {0} was deleted successfully!
de: {0} wurde erfolgreich gelöscht!
es: ¡{0} se eliminó correctamente!
fr: {0} a été supprimé avec succès !
hi: {0} सफलतापूर्वक हटा दिया गया!
ja: {0} は正常に削除されました！
ko: {0}이(가) 성공적으로 삭제되었습니다!
pt: {0} foi excluído com sucesso!
zh_cn: {0} 删除成功！

# FailedToDeleteModel
source: Failed to delete {0}. Please try again.
de: Fehler beim Löschen von {0}. Bitte versuchen Sie es erneut.
es: No se pudo eliminar {0}. Por favor, inténtelo de nuevo.
fr: Échec de la suppression de {0}. Veuillez réessayer.
hi: {0} को हटाने में विफल। कृपया पुनः प्रयास करें।
ja: {0} の削除に失敗しました。もう一度お試しください。
ko: {0}을(를) 삭제하지 못했습니다. 다시 시도해 주세요.
pt: Falha ao excluir {0}. Por favor, tente novamente.
zh_cn: 删除 {0} 失败。请重试。

# ErrorPullingModel
source: Error pulling model: {0}
de: Fehler beim Abrufen des Modells: {0}
es: Error al descargar el modelo: {0}
fr: Erreur lors du téléchargement du modèle : {0}
hi: मॉडल पुल करने में त्रुटि: {0}
ja: モデルのプルエラー: {0}
ko: 모델 가져오기 오류: {0}
pt: Erro ao baixar o modelo: {0}
zh_cn: 拉取模型错误：{0}

source: Create New Knowledgebase
de: Neue Wissensdatenbank erstellen
es: Crear nueva base de conocimiento
fr: Créer une nouvelle base de connaissances
hi: नया ज्ञानआधार बनाएँ
ja: 新しいナレッジベースを作成
ko: 새 지식 베이스 생성
pt: Criar Nova Base de Conhecimento
zh_cn: 创建新知识库

source: Enter Knowledgebase name:
de: Namen der Wissensdatenbank eingeben:
es: Ingrese el nombre de la base de conocimiento:
fr: Saisir le nom de la base de connaissances :
hi: ज्ञानआधार का नाम दर्ज करें:
ja: ナレッジベース名を入力してください:
ko: 지식 베이스 이름을 입력하세요:
pt: Digite o nome da Base de Conhecimento:
zh_cn: 输入知识库名称：

# PleaseEnterKnowledgebaseName
source: Please enter a knowledgebase name
de: Bitte geben Sie einen Namen für die Wissensdatenbank ein
es: Por favor, ingrese un nombre para la base de conocimiento
fr: Veuillez saisir un nom de base de connaissances
hi: कृपया एक ज्ञानआधार नाम दर्ज करें
ja: ナレッジベース名を入力してください
ko: 지식 베이스 이름을 입력해 주세요
pt: Por favor, digite um nome para a base de conhecimento
zh_cn: 请输入知识库名称

source: No Selection
de: Keine Auswahl
es: Sin selección
fr: Aucune sélection
hi: कोई चयन नहीं
ja: 未選択
ko: 선택 없음
pt: Nenhuma Seleção
zh_cn: 未选择
