Repository: view-io/personal
Catalog: src/View.Personal/Resources/Strings.*.resx
Languages: de, es, fr, hi, ja, ko, pt, zh_cn

# ExploreAvailableModels
source: to explore available models
de: um verfügbare Modelle zu erkunden
es: para explorar los modelos disponibles
fr: pour explorer les modèles disponibles
hi: उपलब्ध मॉडल देखने के लिए
ja: して利用可能なモデルを探す
ko: 사용 가능한 모델을 탐색하세요
pt: para explorar os modelos disponíveis
zh_cn: 探索可用模型

# EnterOllamaModelTag
source: Enter Ollama compatible model tag (e.g. qwen2.5:7b)
de: Geben Sie ein mit Ollama kompatibles Modell-Tag ein (z. B. qwen2.5:7b)
es: Ingrese una etiqueta de modelo compatible con Ollama (ej. qwen2.5:7b)
fr: Saisir un tag de modèle compatible Ollama (ex. : qwen2.5:7b)
hi: ओल्लामा संगत मॉडल टैग दर्ज करें (उदा. qwen2.5:7b)
ja: Ollama互換モデルタグ（例: qwen2.5:7b）を入力
ko: Ollama 호환 모델 태그를 입력하세요 (예: qwen2.5:7b)
pt: Digite a tag de modelo compatível com Ollama (ex: qwen2.5:7b)
zh_cn: 输入Ollama兼容型号标签（例如qwen2.5:7b）

source: Pull
de: Abrufen
es: Descargar
fr: Télécharger
hi: पुल करें
ja: プル
ko: 가져오기
pt: Baixar
zh_cn: 拉

source: Cancel
de: Abbrechen
es: Cancelar
fr: Annuler
hi: रद्द करें
ja: キャンセル
ko: 취소
pt: Cancelar
zh_cn: 取消

source: OK
es: Aceptar
hi: ठीक है
ja: わかりました
ko: 확인
zh_cn: 好的

source: No
de: Nein
fr: Non
hi: नहीं
ja: いいえ
ko: 아니요
pt: Não
zh_cn: 不

source: Abort
de: Abbrechen
es: Abortar
fr: Abandonner
hi: निरस्त करें
ja: 中止
ko: 중단
pt: Abortar
zh_cn: 中止

source: Ignore
de: Ignorieren
es: Ignorar
fr: Ignorer
hi: अनदेखा करें
ja: 無視
ko: 무시
pt: Ignorar
zh_cn: 忽略

source: Confirm Deletion
de: Löschung bestätigen
es: Confirmar eliminación
fr: Confirmer la suppression
hi: हटाने की पुष्टि करें
ja: 削除の確認
ko: 삭제 확인
pt: Confirmar Exclusão
zh_cn: 确认删除

# ConfirmDeleteKnowledgebase
source: Are you sure you want to delete the knowledgebase {0}?
de: Möchten Sie die Wissensdatenbank '{0}' wirklich löschen?
es: ¿Está seguro de que desea eliminar la base de conocimiento {0}?
fr: Êtes-vous sûr de vouloir supprimer la base de connaissances {0} ?
hi: क्या आप वाकई नॉलेजबेस '{0}' को हटाना चाहते हैं?
ja: ナレッジベース「{0}」を削除してもよろしいですか？
ko: 지식 베이스 {0}을(를) 정말 삭제하시겠습니까?
pt: Tem certeza de que deseja excluir a base de conhecimento {0}?
zh_cn: 确定要删除知识库“{0}”吗？

source: Confirm Watch
de: Überwachung bestätigen
es: Confirmar vigilancia
fr: Confirmer la surveillance
hi: वॉच की पुष्टि करें
ja: 監視の確認
ko: 감시 확인
pt: Confirmar Vigilância
zh_cn: 确认观看

# ConfirmWatchMessage
source: Watch {0}? This will ingest {1} file{2}.
de: '{0}' überwachen? Dies wird {1} Datei{2} aufnehmen.
es: ¿Vigilar {0}? Esto procesará {1} archivo{2}.
fr: Surveiller {0} ? Cela ingérera {1} fichier{2}.
hi: '{0}' को वॉच करें? इससे {1} फ़ाइल{2} इंजेस्ट होगी।
ja: 「{0}」を監視しますか？これにより{1}個のファイル{2}が取り込まれます。
ko: {0}을(를) 감시하시겠습니까? 이 작업은 {1}개의 파일{2}을 처리합니다.
pt: Vigiar {0}? Isso irá ingerir {1} arquivo{2}.
zh_cn: 观看“{0}”？这将提取 {1} 个文件{2}。

# ConfirmUnwatchMessage
source: Stop watching {0}? This will affect {1} file{2}.
de: Überwachung von '{0}' beenden? Dies betrifft {1} Datei{2}.
es: ¿Dejar de vigilar {0}? Esto afectará a {1} archivo{2}.
fr: Arrêter la surveillance de {0} ? Cela affectera {1} fichier{2}.
hi: '{0}' की वॉच बंद करें? इससे {1} फ़ाइल{2} प्रभावित होंगी।
ja: 「{0}」の監視を停止しますか？これにより{1}個のファイル{2}に影響があります。
ko: {0} 감시를 중단하시겠습니까? 이 작업은 {1}개의 파일{2}에 영향을 줍니다.
pt: Parar de vigiar {0}? Isso afetará {1} arquivo{2}.
zh_cn: 停止观看“{0}”？这将影响 {1} 文件{2}。

# ConfirmRemoveFile
source: Are you sure you want to remove {0}
de: Möchten Sie '{0}' wirklich entfernen
es: ¿Está seguro de que desea eliminar {0}
fr: Êtes-vous sûr de vouloir supprimer {0}
hi: क्या आप वाकई '{0}' को हटाना चाहते हैं
ja: 「{0}」を削除してもよろしいですか
ko: {0}을(를) 정말 삭제하시겠습니까?
pt: Tem certeza de que deseja remover {0}
zh_cn: 您确定要删除“{0}”吗

# FromKnowledgebase
source: from the knowledgebase?
de: aus der Wissensdatenbank?
es: de la base de conocimiento?
fr: de la base de connaissances ?
hi: नॉलेजबेस से?
ja: ナレッジベースから？
ko: 지식 베이스에서?
pt: da base de conhecimento?
zh_cn: 来自知识库？

# NeedInstallOllama
source: You need to install Ollama to pull and use AI models.
de: Sie müssen Ollama installieren, um KI-Modelle abzurufen und zu verwenden.
es: Necesita instalar Ollama para descargar y usar modelos de IA.
fr: Vous devez installer Ollama pour télécharger et utiliser les modèles d'IA.
hi: AI मॉडल को पुल और उपयोग करने के लिए आपको ओलामा इंस्टॉल करने की आवश्यकता है।
ja: AIモデルをプルして使用するには、Ollamaをインストールする必要があります。
ko: AI 모델을 다운로드하고 사용하려면 Ollama를 설치해야 합니다.
pt: Você precisa instalar o Ollama para baixar e usar modelos de IA.
zh_cn: 您需要安装 Ollama 来提取和使用 AI 模型。

source: Delete Model
de: Modell löschen
es: Eliminar modelo
fr: Supprimer le modèle
hi: मॉडल हटाएं
ja: モデルを削除
ko: 모델 삭제
pt: Excluir Modelo
zh_cn: 删除模型

# ConfirmDeleteModel
source: Are you sure you want to delete the model {0}?
de: Möchten Sie das Modell '{0}' wirklich löschen?
es: ¿Está seguro de que desea eliminar el modelo {0}?
fr: Êtes-vous sûr de vouloir supprimer le modèle {0} ?
hi: क्या आप वाकई मॉडल '{0}' को हटाना चाहते हैं?
ja: モデル「{0}」を削除してもよろしいですか？
ko: 모델 {0}을(를) 정말 삭제하시겠습니까?
pt: Tem certeza de que deseja excluir o modelo {0}?
zh_cn: 您确定要删除模型“{0}”吗？

# ActionCannotBeUndone
source: This action cannot be undone.
de: Diese Aktion kann nicht rückgängig gemacht werden.
es: Esta acción no se puede deshacer.
fr: Cette action est irréversible.
hi: यह क्रिया वापस नहीं की जा सकती है।
ja: この操作は元に戻せません。
ko: 이 작업은 되돌릴 수 없습니다.
pt: Esta ação não pode ser desfeita.
zh_cn: 此操作无法撤消。

# PleaseSelectEmbeddingProvider
source: Please select an embedding provider in the settings.
de: Bitte wählen Sie in den Einstellungen einen Embedding-Anbieter aus.
es: Por favor, seleccione un proveedor de embeddings en la configuración.
fr: Veuillez sélectionner un fournisseur d'embedding dans les paramètres.
hi: कृपया सेटिंग्स में एक एम्बेडिंग प्रदाता चुनें।
ja: 設定で埋め込みプロバイダーを選択してください。
ko: 설정에서 임베딩 제공자를 선택해주세요.
pt: Por favor, selecione um provedor de embedding nas configurações.
zh_cn: 请在设置中选择嵌入提供商。

source: Downloaded models
de: Heruntergeladene Modelle
es: Modelos descargados
fr: Modèles téléchargés
hi: डाउनलोड किए गए मॉडल
ja: ダウンロード済みモデル
ko: 다운로드된 모델
pt: Modelos baixados
zh_cn: 下载的模型

source: Choose from existing models
de: Aus vorhandenen Modellen wählen
es: Elegir de modelos existentes
fr: Choisir parmi les modèles existants
hi: मौजूदा मॉडल से चुनें
ja: 既存のモデルから選択
ko: 기존 모델에서 선택
pt: Escolha entre os modelos existentes
zh_cn: 从现有型号中选择

# ParameterSize
source: parameter size: {0}
de: Parametergröße: {0}
es: tamaño de parámetros: {0}
fr: taille des paramètres : {0}
hi: पैरामीटर आकार: {0}
ja: パラメータサイズ: {0}
ko: 매개변수 크기: {0}
pt: tamanho do parâmetro: {0}
zh_cn: 参数大小：{0}

source: Ollama system prompt
de: Ollama-System-Anweisung
es: Prompt de sistema de Ollama
fr: Invite système Ollama
hi: ओल्लामा सिस्टम प्रॉम्प्ट
ja: Ollamaシステムプロンプト
ko: Ollama 시스템 프롬프트
pt: Prompt do sistema Ollama
zh_cn: 奥拉马 系统提示

source: Ollama Endpoint
de: Ollama-Endpunkt
es: Endpoint de Ollama
fr: Point de terminaison Ollama
hi: ओल्लामा एंडपॉइंट
ja: Ollama エンドポイント
ko: Ollama 엔드포인트
pt: Endpoint do Ollama
zh_cn: 奥拉马 端点

source: Ollama Temperature
de: Ollama-Temperatur
es: Temperatura de Ollama
fr: Température Ollama
hi: ओल्लामा तापमान
ko: Ollama 온도
pt: Temperatura do Ollama
zh_cn: 奥拉马 温度

source: Ollama Batch Size
de: Ollama-Batch-Größe
es: Tamaño de lote de Ollama
fr: Taille du lot Ollama
hi: ओल्लामा बैच आकार
ja: Ollama バッチサイズ
ko: Ollama 배치 크기
pt: Tamanho do Lote do Ollama
zh_cn: 奥拉马 批量大小

source: Ollama Max Retries
de: Ollama Max. Wiederholungen
es: Máximo de reintentos de Ollama
fr: Tentatives max. Ollama
hi: ओल्लामा अधिकतम पुनः प्रयास
ja: Ollama 最大リトライ回数
ko: Ollama 최대 재시도 횟수
pt: Máximo de Tentativas do Ollama
zh_cn: 奥拉马 Max Retries

source: Ollama Embedding Model
de: Ollama-Embedding-Modell
es: Modelo de embedding de Ollama
fr: Modèle d'embedding Ollama
hi: ओलामा एम्बेडिंग मॉडल
ja: Ollama 埋め込みモデル
ko: Ollama 임베딩 모델
pt: Modelo de Embedding do Ollama
zh_cn: 奥拉马 嵌入模型

# DimensionalityTooltip
source: The dimensionality of embedding vectors produced by this model.
de: Die Dimensionalität der von diesem Modell erzeugten Embedding-Vektoren.
es: La dimensionalidad de los vectores de embedding producidos por este modelo.
fr: La dimensionalité des vecteurs d'embedding produits par ce modèle.
hi: इस मॉडल द्वारा उत्पन्न एम्बेडिंग वेक्टर्स की आयामिता।
ja: このモデルによって生成される埋め込みベクトルの次元数。
ko: 이 모델에서 생성하는 임베딩 벡터의 차원입니다.
pt: A dimensionalidade dos vetores de embedding produzidos por este modelo.
zh_cn: 该模型产生的嵌入向量的维数。

# MaxTokensTooltip
source: Maximum number of tokens to process for each embedding operation.
de: Maximale Anzahl von Tokens, die für jede Embedding-Operation verarbeitet werden.
es: Número máximo de tokens a procesar en cada operación de embedding.
fr: Nombre maximum de jetons à traiter pour chaque opération d'embedding.
hi: प्रत्येक एम्बेडिंग ऑपरेशन के लिए प्रोसेस करने के लिए अधिकतम टोकन।
ja: 各埋め込み操作で処理する最大トークン数。
ko: 각 임베딩 작업에서 처리할 최대 토큰 수입니다.
pt: Número máximo de tokens a serem processados para cada operação de embedding.
zh_cn: 最大代币数

# EmbeddingDimensionalityTooltip
source: The dimensionality of the embedding vectors generated by this model.
de: Die Dimensionalität der von diesem Modell generierten Embedding-Vektoren.
es: La dimensionalidad de los vectores de embedding generados por este modelo.
fr: La dimensionalité des vecteurs d'embedding générés par ce modèle.
hi: इस मॉडल द्वारा उत्पन्न एम्बेडिंग वेक्टर्स की आयामिकता।
ja: このモデルによって生成される埋込みベクトルの次元数。
ko: 이 모델에서 생성된 임베딩 벡터의 차원입니다.
pt: A dimensionalidade dos vetores de embedding gerados por este modelo.
zh_cn: 该模型生成的嵌入向量的维数。

# EmbeddingMaxTokensTooltip
source: The maximum number of tokens to process for each embedding operation.
de: Die maximale Anzahl von Tokens, die für jede Embedding-Operation verarbeitet werden.
es: El número máximo de tokens a procesar en cada operación de embedding.
fr: Le nombre maximum de jetons à traiter pour chaque opération d'embedding.
hi: प्रत्येक एम्बेडिंग ऑपरेशन के लिए प्रोसेस करने के लिए टोकन की अधिकतम संख्या।
ja: 各埋め込み操作で処理する最大トークン数。
ko: 각 임베딩 작업에서 처리할 최대 토큰 수입니다.
pt: O número máximo de tokens a serem processados para cada operação de embedding.
zh_cn: 每次嵌入操作需要处理的最大标记数。

source: Ollama Enable RAG
de: Ollama RAG aktivieren
es: Habilitar RAG de Ollama
fr: Activer RAG pour Ollama
hi: ओल्लामा RAG सक्षम करें
ja: Ollama RAGを有効にする
ko: Ollama RAG 활성화
pt: Ativar RAG do Ollama
zh_cn: 奥拉马 启用 RAG

source: Ollama RAG Settings Panel
de: Ollama RAG-Einstellungsfenster
es: Panel de configuración de RAG de Ollama
fr: Panneau des paramètres RAG d'Ollama
hi: ओल्लामा RAG सेटिंग्स पैनल
ja: Ollama RAG設定パネル
ko: Ollama RAG 설정 패널
pt: Painel de Configurações RAG do Ollama
zh_cn: 奥拉马 RAG 设置面板

source: Ollama Knowledge Source
de: Ollama-Wissensquelle
es: Fuente de conocimiento de Ollama
fr: Source de connaissances Ollama
hi: ओल्लामा ज्ञान स्रोत
ja: Ollamaナレッジソース
ko: Ollama 지식 소스
pt: Fonte de Conhecimento do Ollama
zh_cn: 奥拉马 知识来源

source: Ollama Enable Context Sorting
de: Ollama-Kontextsortierung aktivieren
es: Habilitar ordenación de contexto de Ollama
fr: Activer le tri du contexte pour Ollama
hi: ओल्लामा संदर्भ क्रमबद्ध करना सक्षम करें
ja: Ollamaコンテキスト並べ替えを有効にする
ko: Ollama 컨텍스트 정렬 활성화
pt: Ativar Ordenação de Contexto do Ollama
zh_cn: 奥拉马 启用上下文排序

# EnterViewEmbeddingsApiKey
source: Enter your View Embeddings API key.
de: Geben Sie Ihren View Embeddings-API-Schlüssel ein.
es: Ingrese su clave de API de View Embeddings.
fr: Saisissez votre clé d'API d'embeddings View.
hi: अपनी व्यू एम्बेडिंग्स एपीआई कुंजी दर्ज करें।
ja: View埋め込みAPIキーを入力してください。
ko: View 임베딩 API 키를 입력하세요.
pt: Digite sua chave de API de Embeddings do View.
zh_cn: 输入您的 View Embeddings API 密钥。

# EnterOllamaHostName
source: Enter the Ollama host name or URL.
de: Geben Sie den Hostnamen oder die URL von Ollama ein.
es: Ingrese el nombre de host o la URL de Ollama.
fr: Saisissez le nom d'hôte ou l'URL d'Ollama.
hi: ओल्लामा होस्ट नाम या यूआरएल दर्ज करें।
ja: Ollamaホスト名またはURLを入力します。
ko: Ollama 호스트 이름 또는 URL을 입력하세요.
pt: Digite o nome do host ou URL do Ollama.
zh_cn: 输入 Ollama 主机名或 URL。

# EnterViewAccessKey
source: Enter your View access key for authentication.
de: Geben Sie Ihren View-Zugriffsschlüssel zur Authentifizierung ein.
es: Ingrese su clave de acceso de View para la autenticación.
fr: Saisissez votre clé d'accès View pour l'authentification.
hi: प्रमाणीकरण के लिए अपनी व्यू एक्सेस कुंजी दर्ज करें।
ja: 認証用のViewアクセスキーを入力してください。
ko: 인증을 위해 View 액세스 키를 입력하세요.
pt: Digite sua chave de acesso do View para autenticação.
zh_cn: 输入您的查看访问密钥进行身份验证。

# EnterViewTenantGUID
source: Enter your View tenant GUID for multi-tenant environments.
de: Geben Sie Ihre View-Mandanten-GUID für mandantenfähige Umgebungen ein.
es: Ingrese su GUID de inquilino de View para entornos multi-inquilino.
fr: Saisissez votre GUID de locataire View pour les environnements multi-locataires.
hi: मल्टी-टेनेंट वातावरण के लिए अपना व्यू टेनेंट जीयूआईडी दर्ज करें।
ja: マルチテナント環境用のViewテナントGUIDを入力してください。
ko: 다중 테넌트 환경을 위해 View 테넌트 GUID를 입력하세요.
pt: Digite seu GUID de inquilino do View para ambientes multi-inquilino.
zh_cn: 输入多租户环境的 View 租户 GUID。

# EnterCustomSystemPrompt
source: Enter a custom system prompt for the model.
de: Geben Sie eine benutzerdefinierte System-Anweisung für das Modell ein.
es: Ingrese un prompt de sistema personalizado para el modelo.
fr: Saisissez une invite système personnalisée pour le modèle.
hi: मॉडल के लिए एक कस्टम सिस्टम प्रॉम्प्ट दर्ज करें।
ja: モデル用のカスタムシステムプロンプトを入力します。
ko: 모델에 대한 사용자 지정 시스템 프롬프트를 입력하세요.
pt: Digite um prompt de sistema personalizado para o modelo.
zh_cn: 输入模型的自定义系统提示。

# DataMonitorTitle
source: Data Monitor
de: Datenüberwachung
es: Monitor de datos
fr: Moniteur de données
hi: डेटा मॉनिटर
ja: データモニター
ko: 데이터 모니터
pt: Monitor de Dados
zh_cn: 数据监控

# AdvancedRAGTitle
source: Advanced RAG
de: Erweitertes RAG
es: RAG avanzado
fr: RAG avancé
hi: उन्नत RAG
ja: 高度なRAG
ko: 고급 RAG
pt: RAG Avançado
zh_cn: 高级RAG

# AdvancedSettingsTitle
source: Advanced Settings
de: Erweiterte Einstellungen
es: Configuración avanzada
fr: Paramètres avancés
hi: उन्नत सेटिंग्स
ja: 詳細設定
ko: 고급 설정
pt: Configurações Avançadas
zh_cn: 高级设置

# RAGSettingsTitle
source: RAG Settings
de: RAG-Einstellungen
es: Configuración de RAG
fr: Paramètres RAG
hi: RAG सेटिंग्स
ja: RAG設定
ko: RAG 설정
pt: Configurações de RAG
zh_cn: RAG 设置

# EnterOpenAIApiKeyTooltip
source: Enter your OpenAI API key.
de: Geben Sie Ihren OpenAI-API-Schlüssel ein.
es: Ingrese su clave de API de OpenAI.
fr: Saisissez votre clé d'API OpenAI.
hi: अपनी ओपनएआई एपीआई कुंजी दर्ज करें।
ja: OpenAI APIキーを入力してください。
ko: OpenAI API 키를 입력하세요. 자세한 정보는 도움말 버튼을 클릭하세요.
pt: Digite sua chave de API da OpenAI.
zh_cn: 输入您的 开放人工智能 应用程序编程接口 密钥。

# EnterAnthropicApiKeyTooltip
source: Enter your Anthropic API key.
de: Geben Sie Ihren Anthropic-API-Schlüssel ein.
es: Ingrese su clave de API de Anthropic.
fr: Saisissez votre clé d'API Anthropic.
hi: अपनी एंथ्रोपिक एपीआई कुंजी दर्ज करें।
ja: Anthropic APIキーを入力してください。
ko: Anthropic API 키를 입력하세요. 자세한 정보는 도움말 버튼을 클릭하세요.
pt: Digite sua chave de API da Anthropic.
zh_cn: 输入您的 Anthropic API 密钥。

# EnterViewEmbeddingsApiKeyTooltip
source: Enter your View embeddings API key.
de: Geben Sie Ihren View-Embeddings-API-Schlüssel ein.
es: Ingrese su clave de API de embeddings de View.
fr: Saisissez votre clé d'API d'embeddings View.
hi: अपनी व्यू एम्बेडिंग्स एपीआई कुंजी दर्ज करें।
ja: View埋め込みAPIキーを入力してください。
ko: View 임베딩 API 키를 입력하세요.
pt: Digite sua chave de API de embeddings do View.
zh_cn: 输入您的 View 嵌入 API 密钥。

# EnterViewAccessKeyTooltip
source: Enter your View access key for authentication.
de: Geben Sie Ihren View-Zugriffsschlüssel zur Authentifizierung ein.
es: Ingrese su clave de acceso de View para la autenticación.
fr: Saisissez votre clé d'accès View pour l'authentification.
hi: प्रमाणीकरण के लिए अपनी व्यू एक्सेस कुंजी दर्ज करें।
ja: 認証用のViewアクセスキーを入力してください。
ko: 인증을 위해 View 액세스 키를 입력하세요.
pt: Digite sua chave de acesso do View para autenticação.
zh_cn: 输入您的查看访问密钥进行身份验证。

# EnterViewTenantGUIDTooltip
source: Enter your View tenant GUID for multi-tenant environments.
de: Geben Sie Ihre View-Mandanten-GUID für mandantenfähige Umgebungen ein.
es: Ingrese su GUID de inquilino de View para entornos multi-inquilino.
fr: Saisissez votre GUID de locataire View pour les environnements multi-locataires.
hi: मल्टी-टेनेंट वातावरण के लिए अपनी व्यू टेनेंट जीयूआईडी दर्ज करें।
ja: マルチテナント環境用のViewテナントGUIDを入力してください。
ko: 다중 테넌트 환경을 위해 View 테넌트 GUID를 입력하세요.
pt: Digite seu GUID de inquilino do View para ambientes multi-inquilino.
zh_cn: 输入多租户环境的 View 租户 GUID。

# EnterVoyageAIApiKeyTooltip
source: Enter your VoyageAI API key for authentication.
de: Geben Sie Ihren VoyageAI-API-Schlüssel zur Authentifizierung ein.
es: Ingrese su clave de API de VoyageAI para la autenticación.
fr: Saisissez votre clé d'API VoyageAI pour l'authentification.
hi: प्रमाणीकरण के लिए अपनी वॉयजएआई एपीआई कुंजी दर्ज करें।
ja: 認証用のVoyageAI APIキーを入力してください。
ko: 인증을 위해 VoyageAI API 키를 입력하세요. 자세한 정보는 도움말 버튼을 클릭하세요.
pt: Digite sua chave de API da VoyageAI para autenticação.
zh_cn: 输入您的 VoyageAI API 密钥进行身份验证。

# OpenAIEmbeddingModelHeader
source: OpenAI Embedding Model
de: OpenAI-Embedding-Modell
es: Modelo de Embedding de OpenAI
fr: Modèle d'embedding OpenAI
hi: ओपनएआई एम्बेडिंग मॉडल
ja: OpenAI 埋め込みモデル
ko: OpenAI 임베딩 모델
pt: Modelo de Embedding da OpenAI
zh_cn: 开放人工智能 嵌入模型

# OllamaEmbeddingModelHeader
source: Ollama Embedding Model
de: Ollama-Embedding-Modell
es: Modelo de Embedding de Ollama
fr: Modèle d'embedding Ollama
hi: ओल्लामा एम्बेडिंग मॉडल
ja: Ollama 埋め込みモデル
ko: Ollama 임베딩 모델
pt: Modelo de Embedding do Ollama
zh_cn: 奥拉马 嵌入模型

# EmbeddingModelName
source: Model Name
de: Modellname
es: Nombre del modelo
fr: Nom du modèle
hi: मॉडल नाम
ja: モデル名
ko: 모델 이름
pt: Nome do Modelo
zh_cn: 型号名称

# EmbeddingDimensionality
source: Dimensionality
de: Dimensionalität
es: Dimensionalidad
fr: Dimensionalité
hi: आयामीता
ja: 次元数
ko: 차원성
pt: Dimensionalidade
zh_cn: 维数

# EmbeddingMaxTokens
source: Max Tokens
es: Máximo de tokens
fr: Jetons max.
hi: अधिकतम टोकन
ja: 最大トークン数
ko: 최대 토큰
pt: Máximo de Tokens
zh_cn: 最大代币数

source: API Key
de: API-Schlüssel
es: Clave de API
fr: Clé d'API
hi: एपीआई कुंजी
ja: APIキー
ko: API 키
pt: Chave de API
zh_cn: 应用程序编程接口 密钥

source: Endpoint
de: Endpunkt
fr: Point de terminaison
hi: एंडपॉइंट
ja: エンドポイント
ko: 엔드포인트
zh_cn: 端点

# PaginationShowingItems
source: Showing {0}-{1} of {2} items
de: Zeige {0}-{1} von {2} Elementen
es: Mostrando {0}-{1} de {2} elementos
fr: Affichage des éléments {0}-{1} sur {2}
hi: {2} में से {0}-{1} आइटम दिखा रहे हैं
ja: {2}件中 {0}-{1}件を表示
ko: 총 {2}개 항목 중 {0}-{1} 표시 중
pt: Mostrando {0}-{1} de {2} itens
zh_cn: 显示 {0}-{1} 个项目（共 {2} 个）

# PaginationNoItems
source: No items to display
de: Keine Elemente zum Anzeigen
es: No hay elementos para mostrar
fr: Aucun élément à afficher
hi: कोई आइटम प्रदर्शित नहीं है
ja: 表示する項目はありません
ko: 표시할 항목이 없습니다
pt: Nenhum item para exibir
zh_cn: 没有可显示的项目

# PaginationPageInfo
source: Page {0} of {1}
de: Seite {0} von {1}
es: Página {0} de {1}
fr: Page {0} sur {1}
hi: पृष्ठ {0} का {1}
ja: {1}ページ中 {0}ページ
ko: {1} 페이지 중 {0} 페이지
pt: Página {0} de {1}
zh_cn: 第 {0} 页（共 {1} 页）

# PaginationNoPages
source: No pages
de: Keine Seiten
es: No hay páginas
fr: Aucune page
hi: कोई पृष्ठ नहीं
ja: ページがありません
ko: 페이지 없음
pt: Nenhuma página
zh_cn: 没有页面

source: File Ingestion Progress
de: Fortschritt der Datei-Aufnahme
es: Progreso de la ingesta de archivos
fr: Progression de l'ingestion de fichiers
hi: फ़ाइल इनजेशन प्रगति
ja: ファイル取り込みの進捗
ko: 파일 수집 진행 상황
pt: Progresso da Ingestão de Arquivos
zh_cn: 文件提取进度

# CurrentIngestion
source: Current Ingestion ({0})
de: Aktuelle Aufnahme ({0})
es: Ingesta actual ({0})
fr: Ingestion en cours ({0})
hi: वर्तमान इनजेशन ({0})
ja: 現在の取り込み ({0})
ko: 현재 수집 중 ({0})
pt: Ingestão Atual ({0})
zh_cn: 当前提取 ({0})

# PendingQueue
source: Pending Queue ({0})
de: Warteschlange ({0})
es: Cola pendiente ({0})
fr: File d'attente ({0})
hi: लंबित कतार ({0})
ja: 待機キュー ({0})
ko: 대기열 ({0})
pt: Fila Pendente ({0})
zh_cn: 待处理队列 ({0})

source: Cancel All
de: Alle abbrechen
es: Cancelar todo
fr: Tout annuler
hi: सभी रद्द करें
ja: すべてキャンセル
ko: 모두 취소
pt: Cancelar Tudo
zh_cn: 全部取消

source: Cancel ingestion
de: Aufnahme abbrechen
es: Cancelar ingesta
fr: Annuler l'ingestion
hi: इनजेशन रद्द करें
ja: 取り込みをキャンセル
ko: 수집 취소
pt: Cancelar ingestão
zh_cn: 取消摄取

source: Available Drives
de: Verfügbare Laufwerke
es: Unidades disponibles
fr: Lecteurs disponibles
hi: उपलब्ध ड्राइव्स
ja: 利用可能なドライブ
ko: 사용 가능한 드라이브
pt: Unidades Disponíveis
zh_cn: 可用驱动器

source: Enter path to navigate...
de: Pfad zur Navigation eingeben...
es: Ingrese una ruta para navegar...
fr: Saisir un chemin pour naviguer...
hi: नेविगेट करने के लिए पथ दर्ज करें...
ja: ナビゲートするパスを入力...
ko: 이동할 경로를 입력하세요...
pt: Digite o caminho para navegar...
zh_cn: 输入路径进行导航...

source: Last Modified
de: Zuletzt geändert
es: Última modificación
fr: Dernière modification
hi: अंतिम संशोधित
ja: 最終更新日時
ko: 마지막 수정일
pt: Última Modificação
zh_cn: 最后修改时间

# ItemIsBeingWatched
source: This item is being watched
de: Dieses Element wird überwacht
es: Este elemento está siendo vigilado
fr: Cet élément est surveillé
hi: यह आइटम निगरानी में है
ja: この項目は監視されています
ko: 이 항목은 감시 중입니다
pt: Este item está sendo vigiado
zh_cn: 此项目正在被关注

# OpenAIBatchSizeTooltip
source: Number of requests to process in a single batch.
de: Anzahl der Anfragen, die in einem einzigen Stapel verarbeitet werden.
es: Número de solicitudes a procesar en un solo lote.
fr: Nombre de requêtes à traiter dans un seul lot.
hi: एक बैच में संसाधित किये जाने वाले अनुरोधों की संख्या.
ja: 1つのバッチで処理するリクエストの数。
ko: 단일 배치에서 처리할 요청 수입니다.
pt: Número de solicitações a serem processadas em um único lote.
zh_cn: 单批处理的请求数。

# OpenAIMaxRetriesTooltip
source: Maximum number of retry attempts for failed requests.
de: Maximale Anzahl von Wiederholungsversuchen bei fehlgeschlagenen Anfragen.
es: Número máximo de reintentos para solicitudes fallidas.
fr: Nombre maximal de tentatives pour les requêtes échouées.
hi: असफल अनुरोधों के लिए पुनः प्रयास की अधिकतम संख्या.
ja: 失敗したリクエストの最大再試行回数。
ko: 실패한 요청에 대한 최대 재시도 횟수입니다.
pt: Número máximo de tentativas de repetição para solicitações com falha.
zh_cn: 失败请求的最大重试次数。

# OpenAITemperatureTooltip
source: Maximum number of retry attempts for failed requests.
de: Steuert die Zufälligkeit der KI-Antworten. Höhere Werte (z. B. 0.8) erzeugen kreativere Ergebnisse, während niedrigere Werte (z. B. 0.2) die Antworten fokussierter und deterministischer machen.
es: Controla la aleatoriedad de las respuestas de la IA. Valores más altos (p.ej., 0.8) producen resultados más creativos, mientras que valores más bajos (p.ej., 0.2) hacen que las respuestas sean más enfocadas y deterministas.
fr: Contrôle le caractère aléatoire des réponses de l'IA. Des valeurs élevées (ex. : 0,8) produisent des résultats plus créatifs, tandis que des valeurs basses (ex. : 0,2) rendent les réponses plus ciblées et déterministes.
hi: AI की प्रतिक्रियाओं की यादृच्छिकता को नियंत्रित करता है। उच्च मान (जैसे, 0.8) अधिक रचनात्मक परिणाम देते हैं, जबकि निम्न मान (जैसे, 0.2) प्रतिक्रियाओं को अधिक केंद्रित और नियतात्मक बनाते हैं।
ja: AIの応答のランダム性を制御します。高い値（例：0.8）はより創造的な出力を生成し、低い値（例：0.2）は応答をより焦点を絞った決定的なものにします。
ko: AI 응답의 무작위성을 제어합니다. 값이 높을수록(예: 0.8) 더 창의적인 결과가 생성되며, 값이 낮을수록(예: 0.2) 응답이 더 집중되고 결정적이게 됩니다.
pt: Controla a aleatoriedade das respostas da IA. Valores mais altos (ex: 0.8) produzem resultados mais criativos, enquanto valores mais baixos (ex: 0.2) tornam as respostas mais focadas e determinísticas.
zh_cn: 控制AI响应的随机性。较高的值（例如0.8）会产生更具创造性的输出，而较低的值（例如0.2）会使响应更具针对性和确定性。

# AnthropicBatchSizeTooltip
source: The number of requests to process in a batch.
de: Die Anzahl der Anfragen, die in einem Stapel verarbeitet werden sollen.
es: El número de solicitudes a procesar en un lote.
fr: Le nombre de requêtes à traiter dans un lot.
hi: एक बैच में संसाधित करने के लिए अनुरोधों की संख्या।
ja: バッチで処理するリクエストの数。
ko: 배치에서 처리할 요청 수입니다.
pt: O número de solicitações a serem processadas em um lote.
zh_cn: 一批要处理的请求数。
