Repository: view-io/personal
Catalog: src/View.Personal/Resources/Strings.*.resx
Languages: de, es, fr, hi, ja, ko, pt, zh_cn

# ViewEmbeddingModelHeader
source: View Embedding Model
de: View-Embedding-Modell
es: Modelo de Embedding de View
fr: Modèle d'embedding View
hi: व्यू एम्बेडिंग मॉडल
ja: View 埋め込みモデル
ko: View 임베딩 모델
pt: Modelo de Embedding do View
zh_cn: 视图嵌入模型

source: Saving settings...
de: Einstellungen werden gespeichert...
es: Guardando configuración...
fr: Enregistrement des paramètres...
hi: सेटिंग्स सहेजी जा रही हैं...
ja: 設定を保存中...
ko: 설정 저장 중...
pt: Salvando configurações...
zh_cn: 正在保存设置...

source: Unselect All
de: Auswahl aufheben
es: Deseleccionar todo
fr: Tout désélectionner
hi: सभी चयन हटाएँ
ja: すべて選択解除
ko: 모두 선택 해제
pt: Desselecionar Tudo
zh_cn: 取消全选

source: Watching
de: Überwacht
es: Vigilando
fr: Surveillance en cours
hi: निगरानी
ja: 監視中
ko: 감시 중
pt: Vigiando
zh_cn: 观看

# SpecifyOpenAIModelTooltip
source: Specify the OpenAI model to use, e.g., gpt-3.5-turbo or gpt-4.
de: Geben Sie das zu verwendende OpenAI-Modell an, z. B. gpt-3.5-turbo oder gpt-4.
es: Especifique el modelo de OpenAI a utilizar, p.ej., gpt-3.5-turbo o gpt-4.
fr: Spécifiez le modèle OpenAI à utiliser, ex. : gpt-3.5-turbo ou gpt-4.
hi: उपयोग करने के लिए ओपनएआई मॉडल निर्दिष्ट करें, जैसे gpt-3.5-turbo या gpt-4।
ja: 使用するOpenAIモデル（例: gpt-3.5-turbo、gpt-4）を指定します。
ko: 사용할 OpenAI 모델을 지정하세요 (예: gpt-3.5-turbo 또는 gpt-4).
pt: Especifique o modelo OpenAI a ser usado, por exemplo, gpt-3.5-turbo ou gpt-4.
zh_cn: 指定要使用的 开放人工智能 模型，例如 gpt-3.5-turbo 或 gpt-4。

# SpecifyAnthropicModelTooltip
source: Specify the Anthropic model to use, e.g., claude-2 or claude-instant-1.
de: Geben Sie das zu verwendende Anthropic-Modell an, z. B. claude-2 oder claude-instant-1.
es: Especifique el modelo de Anthropic a utilizar, p.ej., claude-2 o claude-instant-1.
fr: Spécifiez le modèle Anthropic à utiliser, ex. : claude-2 ou claude-instant-1.
hi: उपयोग करने के लिए एंथ्रॉपिक मॉडल निर्दिष्ट करें, जैसे claude-2 या claude-instant-1।
ja: 使用するAnthropicモデル（例: claude-2、claude-instant-1）を指定します。
ko: 사용할 Anthropic 모델을 지정하세요 (예: claude-2 또는 claude-instant-1).
pt: Especifique o modelo Anthropic a ser usado, por exemplo, claude-2 ou claude-instant-1.
zh_cn: 指定要使用的人择模型，例如 claude-2 或 claude-instant-1。

# SpecifyOllamaModelTooltip
source: Specify the Ollama model to use, e.g., llama2-7B-q4 or mistral-7B.
de: Geben Sie das zu verwendende Ollama-Modell an, z. B. llama2-7B-q4 oder mistral-7B.
es: Especifique el modelo de Ollama a utilizar, p.ej., llama2-7B-q4 o mistral-7B.
fr: Spécifiez le modèle Ollama à utiliser, ex. : llama2-7B-q4 ou mistral-7B.
hi: उपयोग करने के लिए ओल्लामा मॉडल निर्दिष्ट करें, जैसे llama2-7B-q4 या mistral-7B।
ja: 使用するOllamaモデル（例: llama2-7B-q4、mistral-7B）を指定します。
ko: 사용할 Ollama 모델을 지정하세요 (예: llama2-7B-q4 또는 mistral-7B).
pt: Especifique o modelo Ollama a ser usado, por exemplo, llama2-7B-q4 ou mistral-7B.
zh_cn: 指定要使用的 奥拉马 模型，例如 llama2-7B-q4 或 mistral-7B。

# SpecifyViewModelTooltip
source: Specify the View model to use, e.g., llama3.1:8b.
de: Geben Sie das zu verwendende View-Modell an, z. B. llama3.1:8b.
es: Especifique el modelo de View a utilizar, p.ej., llama3.1:8b.
fr: Spécifiez le modèle View à utiliser, ex. : llama3.1:8b.
hi: उपयोग करने के लिए व्यू मॉडल निर्दिष्ट करें, जैसे llama3.1:8b।
ja: 使用するViewモデル（例: llama3.1:8b）を指定します。
ko: 사용할 View 모델을 지정하세요 (예: llama3.1:8b).
pt: Especifique o modelo do View a ser usado, por exemplo, llama3.1:8b.
zh_cn: 指定要使用的视图模型，例如 llama3.1:8b。

# SetOpenAIEndpointTooltip
source: Set the OpenAI API endpoint.
de: Legen Sie den OpenAI-API-Endpunkt fest.
es: Establezca el endpoint de la API de OpenAI.
fr: Définissez le point de terminaison de l'API OpenAI.
hi: ओपनएआई एपीआई एंडपॉइंट सेट करें।
ja: OpenAI APIエンドポイントを設定します。
ko: OpenAI API 엔드포인트를 설정하세요.
pt: Defina o endpoint da API da OpenAI.
zh_cn: 设置 开放人工智能 应用程序编程接口 端点。

# ViewBatchSizeTooltip
source: The number of requests to process in a batch.
de: Die Anzahl der Anfragen, die in einem Stapel verarbeitet werden sollen.
es: El número de solicitudes a procesar en un lote.
fr: Le nombre de requêtes à traiter dans un lot.
hi: एक बैच में संसाधित करने के लिए अनुरोधों की संख्या।
ja: バッチで処理するリクエストの数。
ko: 배치에서 처리할 요청 수입니다.
pt: O número de solicitações a serem processadas em um lote.
zh_cn: 一批要处理的请求数。

# ViewMaxRetriesTooltip
source: Maximum number of retries for failed requests.
de: Maximale Anzahl von Wiederholungen für fehlgeschlagene Anfragen.
es: Número máximo de reintentos para solicitudes fallidas.
fr: Nombre maximum de tentatives pour les requêtes échouées.
hi: विफल अनुरोधों के लिए अधिकतम पुनः प्रयासों की संख्या।
ja: 失敗したリクエストの最大再試行回数。
ko: 실패한 요청에 대한 최대 재시도 횟수입니다.
pt: Número máximo de tentativas de repetição para solicitações com falha.
zh_cn: 失败请求的最大重试次数。

# ViewTemperatureTooltip
source: Controls randomness of the AI's responses. Higher values (e.g., 0.8) produce more creative output, while lower values (e.g., 0.2) make responses more focused and deterministic.
de: Steuert die Zufälligkeit der KI-Antworten. Höhere Werte (z. B. 0.8) erzeugen kreativere Ergebnisse, während niedrigere Werte (z. B. 0.2) die Antworten fokussierter und deterministischer machen.
es: Controla la aleatoriedad de las respuestas de la IA. Valores más altos (p.ej., 0.8) producen resultados más creativos, mientras que valores más bajos (p.ej., 0.2) hacen que las respuestas sean más enfocadas y deterministas.
fr: Contrôle le caractère aléatoire des réponses de l'IA. Des valeurs élevées (ex. : 0,8) produisent des résultats plus créatifs, tandis que des valeurs basses (ex. : 0,2) rendent les réponses plus ciblées et déterministes.
hi: एआई के उत्तरों की यादृच्छिकता को नियंत्रित करता है। उच्च मान (जैसे 0.8) अधिक रचनात्मक आउटपुट देते हैं, जबकि कम मान (जैसे 0.2) उत्तरों को अधिक केंद्रित और निर्धारक बनाते हैं।
ja: AIの応答のランダム性を制御します。高い値（例：0.8）はより創造的な出力を生成し、低い値（例：0.2）は応答をより焦点を絞った決定的なものにします。
ko: AI 응답의 무작위성을 제어합니다. 값이 높을수록(예: 0.8) 더 창의적인 결과가 생성되며, 값이 낮을수록(예: 0.2) 응답이 더 집중되고 결정적이게 됩니다.
pt: Controla a aleatoriedade das respostas da IA. Valores mais altos (ex: 0.8) produzem resultados mais criativos, enquanto valores mais baixos (ex: 0.2) tornam as respostas mais focadas e determinísticas.
zh_cn: 控制AI响应的随机性。较高的值（例如0.8）会产生更具创造性的输出，而较低的值（例如0.2）会使响应更具针对性和确定性。

# ViewEndpointTooltip
source: Set the View API endpoint URL.
de: Legen Sie die URL des View-API-Endpunkts fest.
es: Establezca la URL del endpoint de la API de View.
fr: Définissez l'URL du point de terminaison de l'API View.
hi: व्यू एपीआई एंडपॉइंट यूआरएल सेट करें।
ja: View APIエンドポイントURLを設定します。
ko: View API 엔드포인트 URL을 설정하세요.
pt: Defina a URL do endpoint da API do View.
zh_cn: 设置查看 API 端点 URL。

# ViewSystemPromptTooltip
source: Enter a custom system prompt for the model.
de: Geben Sie eine benutzerdefinierte System-Anweisung für das Modell ein.
es: Ingrese un prompt de sistema personalizado para el modelo.
fr: Saisissez une invite système personnalisée pour le modèle.
hi: मॉडल के लिए एक कस्टम सिस्टम प्रॉम्प्ट दर्ज करें।
ja: モデル用のカスタムシステムプロンプトを入力します。
ko: 모델에 대한 사용자 지정 시스템 프롬프트를 입력하세요.
pt: Digite um prompt de sistema personalizado para o modelo.
zh_cn: 输入模型的自定义系统提示。

source: German
de: Deutsch
es: Alemán
fr: Allemand
hi: जर्मन
ja: ドイツ語
ko: 독일어
pt: Alemão
zh_cn: 德语

source: Spanish
de: Spanisch
es: Español
fr: Espagnol
ja: スペイン語
ko: 스페인어
pt: Espanhol
zh_cn: 西班牙语

source: Korean
de: Koreanisch
es: Coreano
fr: Coréen
ja: 韓国語
ko: 한국인
pt: Coreano
zh_cn: 韩国人

source: Portuguese
de: Portugiesisch
es: Portugués
fr: Portugais
ja: ポルトガル語
ko: 포르투갈 인
pt: Português
zh_cn: 葡萄牙语

source: French
de: Französisch
es: Francés
fr: Français
ja: フランス語
ko: 프랑스 국민
pt: Francês
zh_cn: 法语

# FileReprocessedSuccessfully
source: {0} re-ingested successfully!
es: ¡{0} reingresado exitosamente!
fr: {0} réingéré avec succès !
ja: {0} が正常に再摂取されました。
ko: {0}을(를) 다시 섭취했습니다!
pt: {0} reingerido com sucesso!
zh_cn: {0} 已成功重新提取！

# ResumingIngestionMessage
source: Resuming file ingestion...
es: Reanudando la ingestión de archivos...
fr: Reprise de l'ingestion de fichiers...
ja: ファイルの取り込みを再開しています...
ko: 파일 수집을 재개합니다...
pt: Retomando a ingestão de arquivos...
zh_cn: 正在恢复文件提取...

# SpecifyOpenAIEmbeddingModelTooltip
source: Specify the OpenAI embedding model to use, e.g., text-embedding-3-small.
es: Especifique el modelo de incrustación de OpenAI que se utilizará, por ejemplo, text-embedding-3-small.
ja: 使用する OpenAI 埋め込みモデルを指定します (例: text-embedding-3-small)。
ko: 사용할 OpenAI 임베딩 모델을 지정합니다(예: text-embedding-3-small).
pt: Especifique o modelo de incorporação OpenAI a ser usado, por exemplo, text-embedding-3-small.
zh_cn: 指定要使用的 OpenAI 嵌入模型，例如 text-embedding-3-small。

# SpecifyVoyageAIEmbeddingModelTooltip
source: Specify the VoyageAI embedding model to use, e.g., text-embedding-3-small.
es: Especifique el modelo de incrustación de VoyageAI que se utilizará, por ejemplo, text-embedding-3-small.
ja: 使用する VoyageAI 埋め込みモデルを指定します (例: text-embedding-3-small)。
ko: 사용할 VoyageAI 임베딩 모델을 지정합니다(예: text-embedding-3-small).
pt: Especifique o modelo de incorporação VoyageAI a ser usado, por exemplo, text-embedding-3-small.
zh_cn: 指定要使用的 VoyageAI 嵌入模型，例如 text-embedding-3-small。

source: Embeddings Generation
de: Erzeugung von Embeddings
fr: Génération d'embeddings
hi: एम्बेडिंग्स जनरेशन
pt: Geração de Embeddings
