Repository: view-io/personal
Catalog: src/View.Personal/Resources/Strings.*.resx
Languages: de, es, fr, hi, ja, ko, pt, zh_cn

# PleaseSelectAtLeastOneFile
source: Please select at least one file to remove.
de: Bitte wählen Sie mindestens eine Datei zum Entfernen aus.
es: Por favor, seleccione al menos un archivo para eliminar.
fr: Veuillez sélectionner au moins un fichier à supprimer.
hi: कृपया हटाने के लिए कम से कम एक फ़ाइल का चयन करें।
ja: 削除するファイルを少なくとも1つ選択してください。
ko: 삭제할 파일을 하나 이상 선택해주세요.
pt: Por favor, selecione pelo menos um arquivo para remover.
zh_cn: 请至少选择一个文件进行删除。

# ConsoleLogsSaved
source: Console logs saved successfully
de: Konsolenprotokolle erfolgreich gespeichert
es: Registros de la consola guardados correctamente
fr: Journaux de la console enregistrés avec succès
hi: कंसोल लॉग सफलतापूर्वक सहेजे गए
ja: コンソールログが正常に保存されました
ko: 콘솔 로그가 성공적으로 저장되었습니다
pt: Logs do console salvos com sucesso
zh_cn: 控制台日志保存成功

source: Invalid Endpoint
de: Ungültiger Endpunkt
es: Endpoint no válido
fr: Point de terminaison invalide
hi: अमान्य एंडपॉइंट
ja: 無効なエンドポイント
ko: 잘못된 엔드포인트
pt: Endpoint Inválido
zh_cn: 无效端点

# OllamaEndpointFormat
source: Ollama endpoint must be in the format: http://<hostname or IP>:<port>/
de: Der Ollama-Endpunkt muss das Format haben: http://<Hostname oder IP>:<Port>/
es: El endpoint de Ollama debe tener el formato: http://<hostname o=o IP=IP>:<puerto>/
fr: Le point de terminaison Ollama doit être au format : http://<nom d'hôte=d'hôte ou=ou IP=IP>:<port>/
hi: ओलामा एंडपॉइंट इस प्रारूप में होना चाहिए: http://<होस्टनेम या IP>:<पोर्ट>/
ja: Ollamaエンドポイントは次の形式である必要があります: http://<hostname or IP>:<port>/
ko: Ollama 엔드포인트는 http://<호스트 이름=이름 또는=또는 IP=IP>:<포트>/ 형식이어야 합니다.
pt: O endpoint do Ollama deve estar no formato: http://<nome do=do host=host ou=ou IP=IP>:<porta>/
zh_cn: 奥拉马 端点必须采用格式：http://<主机名或 IP>:<端口>/

# HostnameNotResolvable
source: The {0} endpoint hostname could not be resolved via DNS.
de: Der Hostname des {0}-Endpunkts konnte nicht über DNS aufgelöst werden.
es: El nombre de host del endpoint {0} no se pudo resolver a través de DNS.
fr: Le nom d'hôte du point de terminaison {0} n'a pas pu être résolu via DNS.
hi: {0} एंडपॉइंट होस्टनेम DNS के माध्यम से हल नहीं किया जा सका।
ja: {0} エンドポイントのホスト名はDNSで解決できませんでした。
ko: 엔드포인트 호스트 이름 {0}을(를) DNS를 통해 확인할 수 없습니다.
pt: O nome do host do endpoint {0} não pôde ser resolvido via DNS.
zh_cn: {0} 端点主机名无法通过 DNS 解析。

source: Access Denied
de: Zugriff verweigert
es: Acceso denegado
fr: Accès refusé
hi: पहुंच अस्वीकृत
ja: アクセスが拒否されました
ko: 액세스 거부됨
pt: Acesso Negado
zh_cn: 访问被拒绝

# CannotAccessPath
source: Cannot access {0}: {1}
de: Zugriff auf {0} nicht möglich: {1}
es: No se puede acceder a {0}: {1}
fr: Impossible d'accéder à {0} : {1}
hi: {0} तक पहुंच नहीं हो सकती: {1}
ja: {0}にアクセスできません: {1}
ko: {0}에 액세스할 수 없습니다: {1}
pt: Não é possível acessar {0}: {1}
zh_cn: 无法访问 {0}：{1}

# FailedToLoadDirectory
source: Failed to load directory: {0}
de: Fehler beim Laden des Verzeichnisses: {0}
es: Error al cargar el directorio: {0}
fr: Échec du chargement du répertoire : {0}
hi: निर्देशिका लोड करने में विफल: {0}
ja: ディレクトリの読み込みに失敗しました: {0}
ko: 디렉터리 로드 실패: {0}
pt: Falha ao carregar o diretório: {0}
zh_cn: 加载目录失败：{0}

source: Invalid Path
de: Ungültiger Pfad
es: Ruta no válida
fr: Chemin invalide
hi: अमान्य पथ
ja: 無効なパス
ko: 잘못된 경로
pt: Caminho Inválido
zh_cn: 无效路径

# PleaseEnterValidPath
source: Please enter a valid path.
de: Bitte geben Sie einen gültigen Pfad ein.
es: Por favor, ingrese una ruta válida.
fr: Veuillez saisir un chemin valide.
hi: कृपया एक वैध पथ दर्ज करें।
ja: 有効なパスを入力してください。
ko: 유효한 경로를 입력해주세요.
pt: Por favor, insira um caminho válido.
zh_cn: 请输入有效路径。

source: Path Not Found
de: Pfad nicht gefunden
es: Ruta no encontrada
fr: Chemin non trouvé
hi: पथ नहीं मिला
ja: パスが見つかりません
ko: 경로를 찾을 수 없음
pt: Caminho Não Encontrado
zh_cn: 路径未找到

# PathDoesNotExist
source: The path {0} does not exist.
de: Der Pfad '{0}' existiert nicht.
es: La ruta {0} no existe.
fr: Le chemin {0} n'existe pas.
hi: पथ '{0}' मौजूद नहीं है।
ja: パス {0} は存在しません。
ko: 경로 {0}이(가) 존재하지 않습니다.
pt: O caminho {0} não existe.
zh_cn: 路径 {0} 不存在。

# FailedToNavigatePath
source: Failed to navigate to {0}: {1}
de: Navigation zu '{0}' fehlgeschlagen: {1}
es: Error al navegar a {0}: {1}
fr: Échec de la navigation vers {0} : {1}
hi: '{0}' पर नेविगेट करने में विफल: {1}
ja: {0}へのナビゲーションに失敗しました: {1}
ko: {0}(으)로 이동 실패: {1}
pt: Falha ao navegar para {0}: {1}
zh_cn: 导航到 {0} 失败：{1}

source: Model Downloaded
de: Modell heruntergeladen
es: Modelo descargado
fr: Modèle téléchargé
hi: मॉडल डाउनलोड किया गया
ja: モデルがダウンロードされました
ko: 모델 다운로드됨
pt: Modelo Baixado
zh_cn: 模型已下载

# ModelDownloadedSuccess
source: {0} was pulled successfully!
de: {0} wurde erfolgreich abgerufen!
es: ¡{0} se descargó correctamente!
fr: {0} a été téléchargé avec succès !
hi: {0} सफलतापूर्वक पुल किया गया!
ja: {0} は正常にプルされました！
ko: {0}이(가) 성공적으로 다운로드되었습니다!
pt: O modelo {0} foi baixado com sucesso!
zh_cn: {0} 拉取成功！

# FilesDeletedPartial
source: Deleted {0} files. Failed to delete {1} files.
de: {0} Dateien gelöscht. Fehler beim Löschen von {1} Dateien.
es: Se eliminaron {0} archivos. No se pudieron eliminar {1} archivos.
fr: {0} fichiers supprimés. Échec de la suppression de {1} fichiers.
hi: {0} फ़ाइलें हटा दी गईं। {1} फ़ाइलें हटाने में विफल रहे।
ja: {0}個のファイルを削除しました。{1}個のファイルの削除に失敗しました。
ko: {0}개의 파일이 삭제되었습니다. {1}개의 파일은 삭제하지 못했습니다.
pt: Excluídos {0} arquivos. Falha ao excluir {1} arquivos.
zh_cn: 已删除 {0} 个文件。删除 {1} 个文件失败。

# FilesDeletedSuccess
source: {0} files were deleted successfully!
de: {0} Dateien wurden erfolgreich gelöscht!
es: ¡Se eliminaron {0} archivos correctamente!
fr: {0} fichiers ont été supprimés avec succès !
hi: {0} फ़ाइलें सफलतापूर्वक हटा दी गईं!
ja: {0}個のファイルが正常に削除されました！
ko: {0}개의 파일이 성공적으로 삭제되었습니다!
pt: {0} arquivos foram excluídos com sucesso!
zh_cn: {0} 个文件删除成功！

# FailedToGenerateEmbeddings
source: Failed to generate embeddings for chunks with status {0}
de: Fehler beim Erzeugen von Embeddings für Chunks mit dem Status {0}
es: Error al generar embeddings para los fragmentos con estado {0}
fr: Échec de la génération des embeddings pour les morceaux avec le statut {0}
hi: चंक्स के लिए एम्बेडिंग्स जनरेट करने में विफल स्थिति {0}
ja: ステータス{0}のチャンクの埋め込み生成に失敗しました
ko: 상태가 {0}인 청크에 대한 임베딩 생성에 실패했습니다
pt: Falha ao gerar embeddings para os blocos com status {0}
zh_cn: 为状态为 {0} 的块生成嵌入失败

# LanguagePreferenceSaved
source: Your language preference has been saved and applied.
de: Ihre Spracheinstellung wurde gespeichert und angewendet.
es: Su preferencia de idioma ha sido guardada y aplicada.
fr: Votre préférence de langue a été enregistrée et appliquée.
hi: आपकी भाषा प्राथमिकता सहेज ली गई है और लागू कर दी गई है।
ja: 言語設定が保存され、適用されました。
ko: 언어 설정이 저장 및 적용되었습니다.
pt: Sua preferência de idioma foi salva e aplicada.
zh_cn: 您的语言偏好已保存并应用。

# FailedToSaveLanguageSetting
source: Failed to save language setting: {0}
de: Fehler beim Speichern der Spracheinstellung: {0}
es: Error al guardar la configuración de idioma: {0}
fr: Échec de l'enregistrement du paramètre de langue : {0}
hi: भाषा सेटिंग सहेजने में विफल: {0}
ja: 言語設定の保存に失敗しました: {0}
ko: 언어 설정 저장 실패: {0}
pt: Falha ao salvar a configuração de idioma: {0}
zh_cn: 保存语言设置失败：{0}

# ConfirmRemoveSelectedFiles
source: Are you sure you want to remove the selected files from the knowledgebase?
de: Möchten Sie die ausgewählten Dateien wirklich aus der Wissensdatenbank entfernen?
es: ¿Está seguro de que desea eliminar los archivos seleccionados de la base de conocimiento?
fr: Êtes-vous sûr de vouloir supprimer les fichiers sélectionnés de la base de connaissances ?
hi: क्या आप वाकई ज्ञानकोष से चयनित फ़ाइलें हटाना चाहते हैं?
ja: 選択したファイルをナレッジベースから削除してもよろしいですか？
ko: 선택한 파일을 지식 베이스에서 제거하시겠습니까?
pt: Tem certeza de que deseja remover os arquivos selecionados da base de conhecimento?
zh_cn: 确定要从知识库中删除选定的文件吗？

# ErrorIngesting
source: Error ingesting {0}: {1}
de: Fehler bei der Aufnahme von {0}: {1}
es: Error al procesar {0}: {1}
fr: Erreur lors de l'ingestion de {0} : {1}
hi: {0} को इंजेस्ट करने में त्रुटि: {1}
ja: {0}の取り込みエラー: {1}
ko: {0} 수집 중 오류: {1}
pt: Erro ao ingerir {0}: {1}
zh_cn: 摄取 {0} 时出错：{1}

# BatchIngestionPartialSuccess
source: Successfully ingested {0} files. {1} files failed.
de: {0} Dateien erfolgreich aufgenommen. {1} Dateien fehlgeschlagen.
es: Se procesaron correctamente {0} archivos. {1} archivos fallaron.
fr: {0} fichiers ingérés avec succès. Échec pour {1} fichiers.
hi: सफलतापूर्वक {0} फ़ाइलें इंजेस्ट की गईं। {1} फ़ाइलें विफल रहीं।
ja: {0}個のファイルの取り込みに成功しました。{1}個のファイルは失敗しました。
ko: {0}개의 파일이 성공적으로 수집되었습니다. {1}개의 파일이 실패했습니다.
pt: Ingeridos com sucesso {0} arquivos. {1} arquivos falharam.
zh_cn: 成功摄取 {0} 个文件。{1} 个文件失败。

# BatchIngestionFullSuccess
source: Successfully ingested all {0} files.
de: Alle {0} Dateien erfolgreich aufgenommen.
es: Se procesaron correctamente todos los {0} archivos.
fr: Tous les {0} fichiers ont été ingérés avec succès.
hi: सभी {0} फ़ाइलें सफलतापूर्वक इंजेस्ट की गईं।
ja: 全{0}個のファイルの取り込みに成功しました。
ko: 총 {0}개의 파일이 모두 성공적으로 수집되었습니다.
pt: Todos os {0} arquivos foram ingeridos com sucesso.
zh_cn: 成功摄取所有 {0} 个文件。

# IngestionCancelledMessage
source: Ingestion of {0} was cancelled.
de: Die Aufnahme von {0} wurde abgebrochen.
es: La ingesta de {0} fue cancelada.
fr: L'ingestion de {0} a été annulée.
hi: {0} का इंजेस्शन रद्द कर दिया गया था।
ja: {0}の取り込みはキャンセルされました。
ko: {0}의 수집이 취소되었습니다.
pt: A ingestão de {0} foi cancelada.
zh_cn: {0} 的摄取已取消。

# ErrorResumingIngestion
source: Error resuming ingestion: {0}
de: Fehler beim Fortsetzen der Aufnahme: {0}
es: Error al reanudar la ingesta: {0}
fr: Erreur lors de la reprise de l'ingestion : {0}
hi: इंजेस्शन फिर से शुरू करने में त्रुटि: {0}
ja: 取り込み再開エラー: {0}
ko: 수집 재개 중 오류: {0}
pt: Erro ao retomar a ingestão: {0}
zh_cn: 恢复摄取时出错：{0}

# FailedToLoadDrives
source: Failed to load drives: {0}
de: Fehler beim Laden der Laufwerke: {0}
es: Error al cargar las unidades: {0}
fr: Échec du chargement des lecteurs : {0}
hi: ड्राइव लोड करने में विफल: {0}
ja: ドライブの読み込みに失敗しました: {0}
ko: 드라이브 로드 실패: {0}
pt: Falha ao carregar as unidades: {0}
zh_cn: 加载驱动器失败：{0}

source: No watched paths to sync.
de: Keine überwachten Pfade zum Synchronisieren.
es: No hay rutas vigiladas para sincronizar.
fr: Aucun chemin surveillé à synchroniser.
hi: सिंक करने के लिए कोई निगरानी वाले पथ नहीं हैं।
ja: 同期する監視対象パスがありません。
ko: 동기화할 감시 경로가 없습니다.
pt: Nenhum caminho vigiado para sincronizar.
zh_cn: 没有监控的路径可同步。

# AccessDeniedToDirectory
source: Access denied to directory: {0}.
de: Zugriff auf Verzeichnis {0} verweigert.
es: Acceso denegado al directorio: {0}.
fr: Accès refusé au répertoire : {0}.
hi: निर्देशिका तक पहुंच अस्वीकृत: {0}।
ja: ディレクトリへのアクセスが拒否されました: {0}。
ko: 디렉터리 액세스 거부: {0}.
pt: Acesso negado ao diretório: {0}.
zh_cn: 访问目录被拒绝：{0}。

source: OpenAI embedding settings incomplete.
de: OpenAI-Embedding-Einstellungen unvollständig.
es: La configuración de embeddings de OpenAI está incompleta.
fr: Paramètres d'embedding OpenAI incomplets.
hi: ओपनएआई एम्बेडिंग सेटिंग्स अपूर्ण हैं।
ja: OpenAI埋め込み設定が不完全です。
ko: OpenAI 임베딩 설정이 불완전합니다.
pt: Configurações de embedding da OpenAI incompletas.
zh_cn: 开放人工智能 嵌入设置不完整。

source: Local embedding model not configured.
de: Lokales Embedding-Modell nicht konfiguriert.
es: Modelo de embedding local no configurado.
fr: Modèle d'embedding local non configuré.
hi: स्थानीय एम्बेडिंग मॉडल कॉन्फ़िगर नहीं किया गया है।
ja: ローカル埋め込みモデルが設定されていません。
ko: 로컬 임베딩 모델이 구성되지 않았습니다.
pt: Modelo de embedding local não configurado.
zh_cn: 本地嵌入模型未配置。

# NoConsoleLogs
source: No console logs to download
de: Keine Konsolenprotokolle zum Herunterladen
es: No hay registros de consola para descargar
fr: Aucun journal de console à télécharger
hi: डाउनलोड करने के लिए कोई कंसोल लॉग नहीं
ja: ダウンロードするコンソールログはありません
ko: 다운로드할 콘솔 로그가 없습니다
pt: Não há logs do console para baixar
zh_cn: 没有控制台日志可下载

source: Failed to save console logs
de: Fehler beim Speichern der Konsolenprotokolle
es: Error al guardar los registros de la consola
fr: Échec de l'enregistrement des journaux de la console
hi: कंसोल लॉग सहेजने में विफल
ja: コンソールログの保存に失敗しました
ko: 콘솔 로그 저장 실패
pt: Falha ao salvar os logs do console
zh_cn: 保存控制台日志失败

source: Files
de: Dateien
es: Archivos
fr: Fichiers
hi: फ़ाइलें
ja: ファイル
ko: 파일
pt: Arquivos
zh_cn: 文件

source: Data Monitor
de: Datenüberwachung
es: Monitor de datos
fr: Moniteur de données
hi: डेटा मॉनिटर
ja: データモニター
ko: 데이터 모니터
pt: Monitor de Dados
zh_cn: 数据监控

source: Console
de: Konsole
es: Consola
hi: कंसोल
ja: コンソール
ko: 콘솔
zh_cn: 控制台

source: Chat History
de: Chatverlauf
es: Historial de chat
fr: Historique des discussions
hi: चैट इतिहास
ja: チャット履歴
ko: 채팅 기록
pt: Histórico de Chat
zh_cn: 聊天历史

# ManageFiles
source: Manage the files you want to chat with
de: Verwalten Sie die Dateien, mit denen Sie chatten möchten
es: Administre los archivos con los que desea chatear
fr: Gérez les fichiers avec lesquels vous voulez discuter
hi: उन फ़ाइलों का प्रबंधन करें जिनके साथ आप चैट करना चाहते हैं
ja: チャットしたいファイルを管理する
ko: 채팅할 파일을 관리하세요
pt: Gerencie os arquivos com os quais você quer conversar
zh_cn: 管理您想要聊天的文件

# MonitorFiles
source: Continuously monitor files and folders for ingestion
de: Dateien und Ordner kontinuierlich auf Aufnahme überwachen
es: Supervise continuamente archivos y carpetas para su ingesta
fr: Surveillez en continu les fichiers et dossiers pour l'ingestion
hi: इंजेस्शन के लिए फ़ाइलों और फ़ोल्डरों की निरंतर निगरानी करें
ja: ファイルとフォルダを取り込みのために継続的に監視する
ko: 수집을 위해 파일 및 폴더를 지속적으로 모니터링하세요
pt: Monitore continuamente arquivos e pastas para ingestão
zh_cn: 持续监控文件和文件夹进行摄取

# ConfigureLLM
source: Configure your LLM and API keys
de: Konfigurieren Sie Ihr LLM und Ihre API-Schlüssel
es: Configure su LLM y claves de API
fr: Configurez votre LLM et vos clés d'API
hi: अपने एलएलएम और एपीआई कुंजियों को कॉन्फ़िगर करें
ja: LLMとAPIキーを設定する
ko: LLM 및 API 키 구성
pt: Configure seu LLM e chaves de API
zh_cn: 配置您的 LLM 和 应用程序编程接口 密钥

# ChatWithData
source: Chat with your data
de: Chatten Sie mit Ihren Daten
es: Chatee con sus datos
fr: Discutez avec vos données
hi: अपने डेटा के साथ चैट करें
ja: データとチャットする
ko: 데이터와 채팅하기
pt: Converse com seus dados
zh_cn: 与您的数据聊天

source: Click to upload
de: Klicken Sie zum Hochladen
es: Haga clic para subir
fr: Cliquez pour téléverser
hi: अपलोड करने के लिए क्लिक करें
ja: クリックしてアップロード
ko: 클릭하여 업로드
pt: Clique para carregar
zh_cn: 点击上传

source: or drag and drop
de: oder ziehen Sie sie hierher
es: o arrastre y suelte
fr: ou glissez-déposez
hi: या खींचें और छोड़ें
ja: またはドラッグアンドドロップ
ko: 또는 드래그 앤 드롭
pt: ou arraste e solte
zh_cn: 或拖放

# MaxFileSize
source: (max file size 500mb)
de: (max. Dateigröße 500 MB)
es: (tamaño máximo de archivo 500mb)
fr: (taille de fichier max 500 Mo)
hi: (अधिकतम फ़ाइल आकार 500mb)
ja: (最大ファイルサイズ 500MB)
ko: (최대 파일 크기 500mb)
pt: (tamanho máximo do arquivo 500mb)
zh_cn: （最大文件大小 500mb）

source: Name
es: Nombre
fr: Nom
hi: नाम
ja: 名前
ko: 이름
pt: Nome
zh_cn: 姓名

source: Date Created
de: Erstellungsdatum
es: Fecha de creación
fr: Date de création
hi: बनाने की तिथि
ja: 作成日
ko: 생성 날짜
pt: Data de Criação
zh_cn: 创建日期

source: Actions
de: Aktionen
es: Acciones
hi: कार्रवाई
ja: アクション
ko: 작업
pt: Ações
zh_cn: 行动

source: Open in File Explorer
de: Im Datei-Explorer öffnen
es: Abrir en el Explorador de archivos
fr: Ouvrir dans l'Explorateur de fichiers
hi: फ़ाइल एक्सप्लोरर में खोलें
ja: ファイルエクスプローラーで開く
ko: 파일 탐색기에서 열기
pt: Abrir no Explorador de Arquivos
zh_cn: 在文件资源管理器中打开

source: Delete file
de: Datei löschen
es: Eliminar archivo
fr: Supprimer le fichier
hi: फ़ाइल हटाएं
ja: ファイルを削除
ko: 파일 삭제
pt: Excluir arquivo
zh_cn: 删除文件

source: No items to display
de: Keine Elemente zum Anzeigen
es: No hay elementos para mostrar
fr: Aucun élément à afficher
hi: प्रदर्शित करने के लिए कोई आइटम नहीं
ja: 表示する項目はありません
ko: 표시할 항목이 없습니다
pt: Nenhum item para exibir
zh_cn: 没有可显示的项目

source: No pages
de: Keine Seiten
es: No hay páginas
fr: Aucune page
hi: कोई पृष्ठ नहीं
ja: ページがありません
ko: 페이지 없음
pt: Nenhuma página
zh_cn: 没有页面

source: First page
de: Erste Seite
es: Primera página
fr: Première page
hi: पहला पृष्ठ
ja: 最初のページ
ko: 첫 페이지
pt: Primeira página
zh_cn: 第一页

source: Previous page
de: Vorherige Seite
es: Página anterior
fr: Page précédente
hi: पिछला पृष्ठ
ja: 前のページ
ko: 이전 페이지
pt: Página anterior
zh_cn: 上一页

source: Next page
de: Nächste Seite
es: Página siguiente
fr: Page suivante
hi: अगला पृष्ठ
ja: 次のページ
ko: 다음 페이지
pt: Próxima página
zh_cn: 下一页

source: Last page
de: Letzte Seite
es: Última página
fr: Dernière page
hi: अंतिम पृष्ठ
ja: 最後のページ
ko: 마지막 페이지
pt: Última página
zh_cn: 最后一页

source: Items per page:
de: Elemente pro Seite:
es: Elementos por página:
fr: Éléments par page :
hi: प्रति पृष्ठ आइटम:
ja: ページあたりの項目数:
ko: 페이지당 항목:
pt: Itens por página:
zh_cn: 每页项目数：

source: Enter user message...
de: Benutzernachricht eingeben...
es: Escriba un mensaje...
fr: Saisir le message de l'utilisateur...
hi: उपयोगकर्ता संदेश दर्ज करें...
ja: ユーザーメッセージを入力...
ko: 메시지를 입력하세요...
pt: Digite a mensagem do usuário...
zh_cn: 输入用户留言...

source: Clear
de: Leeren
es: Limpiar
fr: Effacer
hi: साफ़ करें
ja: クリア
ko: 지우기
pt: Limpar
zh_cn: 清除

source: Download
de: Herunterladen
es: Descargar
fr: Télécharger
hi: डाउनलोड करें
ja: ダウンロード
ko: 다운로드
pt: Baixar
zh_cn: 下载

# Copyright
source: Â©2025 View Systems Inc.
de: ©2025 View Systems Inc.
es: ©2025 View Systems Inc.
fr: ©2025 View Systems Inc.
hi: ©2025 व्यू सिस्टम्स इंक.
ja: ©2025 View Systems Inc.
ko: ©2025 View Systems Inc.
pt: ©2025 View Systems Inc.
zh_cn: ©2025 查看系统公司

source: New Knowledgebase
de: Neue Wissensdatenbank
es: Nueva base de conocimiento
fr: Nouvelle base de connaissances
hi: नया ज्ञान आधार
ja: 新しいナレッジベース
ko: 새 지식 베이스
pt: Nova Base de Conhecimento
zh_cn: 新知识库

source: Export to GEXF
de: Nach GEXF exportieren
es: Exportar a GEXF
fr: Exporter vers GEXF
hi: GEXF में निर्यात करें
ja: GEXFにエクスポート
ko: GEXF로 내보내기
pt: Exportar para GEXF
zh_cn: 导出至 GEXF

source: Nodes
de: Knoten
es: Nodos
fr: Nœuds
hi: नोड्स
ja: ノード
ko: 노드
pt: Nós
zh_cn: 节点

source: Created
de: Erstellt
es: Creado
fr: Créé le
hi: बनाया गया
ja: 作成日時
ko: 생성됨
pt: Criado
zh_cn: 已创建

source: Last Update
de: Letzte Aktualisierung
es: Última actualización
fr: Dernière mise à jour
hi: अंतिम अपडेट
ja: 最終更新
ko: 마지막 업데이트
pt: Última Atualização
zh_cn: 最后更新

source: Delete knowledgebase
de: Wissensdatenbank löschen
es: Eliminar base de conocimiento
fr: Supprimer la base de connaissances
hi: ज्ञान आधार हटाएं
ja: ナレッジベースを削除
ko: 지식 베이스 삭제
pt: Excluir base de conhecimento
zh_cn: 删除知识库

source: Providers
de: Anbieter
es: Proveedores
fr: Fournisseurs
hi: प्रदाता
ja: プロバイダー
ko: 제공자
pt: Provedores
zh_cn: 供应商

source: OpenAI
hi: ओपनएआई
zh_cn: 开放人工智能

# GainAccessToOpenAI
source: Gain access to OpenAI models
de: Erhalten Sie Zugriff auf OpenAI-Modelle
es: Obtenga acceso a los modelos de OpenAI
fr: Accédez aux modèles OpenAI
hi: ओपनएआई मॉडल तक पहुंच प्राप्त करें
ja: OpenAIモデルへのアクセスを取得
ko: OpenAI 모델에 액세스하세요
pt: Obtenha acesso aos modelos da OpenAI
zh_cn: 获得 开放人工智能 模型的访问权限

source: Knowledgebases
de: Wissensdatenbanken
es: Bases de conocimiento
fr: Bases de connaissances
hi: ज्ञान आधार
ja: ナレッジベース
ko: 지식 베이스
pt: Bases de Conhecimento
zh_cn: 知识库

# EnterOpenAIApiKey
source: Enter your OpenAI API key.
de: Geben Sie Ihren OpenAI-API-Schlüssel ein.
es: Ingrese su clave de API de OpenAI.
fr: Saisissez votre clé d'API OpenAI.
hi: अपनी ओपनएआई एपीआई कुंजी दर्ज करें।
ja: OpenAI APIキーを入力してください。
ko: OpenAI API 키를 입력하세요.
pt: Digite sua chave de API da OpenAI.
zh_cn: 输入您的 开放人工智能 应用程序编程接口 密钥。

# EnterSystemPrompt
source: Enter a custom system prompt for the model.
de: Geben Sie eine benutzerdefinierte System-Anweisung für das Modell ein.
es: Ingrese un prompt de sistema personalizado para el modelo.
fr: Saisissez une invite système personnalisée pour le modèle.
hi: मॉडल के लिए एक कस्टम सिस्टम प्रॉम्प्ट दर्ज करें।
ja: モデルのカスタムシステムプロンプトを入力します。
ko: 모델에 대한 사용자 지정 시스템 프롬프트를 입력하세요.
pt: Digite um prompt de sistema personalizado para o modelo.
zh_cn: 输入模型的自定义系统提示。

# EnterAnthropicApiKey
source: Enter your Anthropic API key.
de: Geben Sie Ihren Anthropic-API-Schlüssel ein.
es: Ingrese su clave de API de Anthropic.
fr: Saisissez votre clé d'API Anthropic.
hi: अपनी एंथ्रोपिक एपीआई कुंजी दर्ज करें।
ja: Anthropic APIキーを入力してください。
ko: Anthropic API 키를 입력하세요.
pt: Digite sua chave de API da Anthropic.
zh_cn: 输入您的 Anthropic API 密钥。

# BatchSizeTooltip
source: Number of requests to process in a single batch.
de: Anzahl der Anfragen, die in einem einzigen Stapel verarbeitet werden.
es: Número de solicitudes a procesar en un solo lote.
fr: Nombre de requêtes à traiter dans un seul lot.
hi: एक बैच में प्रोसेस करने के लिए अनुरोधों की संख्या।
ja: 1つのバッチで処理するリクエストの数。
ko: 단일 배치에서 처리할 요청 수입니다.
pt: Número de solicitações a serem processadas em um único lote.
zh_cn: 单批处理的请求数。

# MaxRetriesTooltip
source: Maximum number of retry attempts for failed requests.
de: Maximale Anzahl von Wiederholungsversuchen bei fehlgeschlagenen Anfragen.
es: Número máximo de reintentos para solicitudes fallidas.
fr: Nombre maximal de tentatives pour les requêtes échouées.
hi: विफल अनुरोधों के लिए अधिकतम पुनः प्रयास प्रयासों की संख्या।
ja: 失敗したリクエストの最大再試行回数。
ko: 실패한 요청에 대한 최대 재시도 횟수입니다.
pt: Número máximo de tentativas de repetição para solicitações com falha.
zh_cn: 失败请求的最大重试次数。

source: Configure advanced RAG settings
de: Erweiterte RAG-Einstellungen konfigurieren
es: Configurar los ajustes avanzados de RAG
fr: Configurer les paramètres RAG avancés
hi: उन्नत RAG सेटिंग्स कॉन्फ़िगर करें
ja: 高度なRAG設定を構成
ko: 고급 RAG 설정 구성
pt: Configurar definições avançadas de RAG
zh_cn: 配置高级 RAG 设置

source: Advanced RAG
de: Erweitertes RAG
es: RAG avanzado
fr: RAG avancé
hi: उन्नत RAG
ja: 高度なRAG
ko: 고급 RAG
pt: RAG Avançado
zh_cn: 高级RAG

# MaxRetrievedTooltip
source: Maximum number of documents to retrieve
de: Maximale Anzahl abzurufender Dokumente
es: Número máximo de documentos a recuperar
fr: Nombre maximum de documents à récupérer
hi: पुनर्प्राप्त करने के लिए दस्तावेज़ों की अधिकतम संख्या
ja: 取得するドキュメントの最大数
ko: 검색할 최대 문서 수
pt: Número máximo de documentos a serem recuperados
zh_cn: 检索的最大文档数

# QueryOptimizationTooltip
source: Optimize queries for better retrieval results
de: Optimieren Sie Abfragen für bessere Abrufergebnisse
es: Optimizar consultas para obtener mejores resultados de recuperación
fr: Optimiser les requêtes pour de meilleurs résultats de récupération
hi: बेहतर पुनर्प्राप्ति परिणामों के लिए क्वेरी अनुकूलित करें
ja: より良い検索結果のためにクエリを最適化する
ko: 더 나은 검색 결과를 위해 쿼리 최적화
pt: Otimizar consultas para melhores resultados de recuperação
zh_cn: 优化查询以获得更好的检索结果

# EnableCitationsTooltip
source: Include citations in the generated responses
de: Zitate in die generierten Antworten aufnehmen
es: Incluir citas en las respuestas generadas
fr: Inclure les citations dans les réponses générées
hi: उत्पन्न प्रतिक्रियाओं में उद्धरण शामिल करें
ja: 生成された応答に引用を含める
ko: 생성된 응답에 인용 포함
pt: Incluir citações nas respostas geradas
zh_cn: 在生成的响应中包含引用

source: Enable citations
de: Zitate aktivieren
es: Habilitar citas
fr: Activer les citations
hi: उद्धरण सक्षम करें
ja: 引用を有効にする
ko: 인용 활성화
pt: Ativar citações
zh_cn: 启用引用

source: Enable context sorting
de: Kontextsortierung aktivieren
es: Habilitar ordenación de contexto
fr: Activer le tri du contexte
hi: संदर्भ क्रमबद्ध करना सक्षम करें
ja: コンテキストの並べ替えを有効にする
ko: 컨텍스트 정렬 활성화
pt: Ativar ordenação de contexto
zh_cn: 启用上下文排序

source: Ollama Models
es: Modelos Ollama
ja: オラマモデル
ko: 올라마 모델
pt: Modelos Ollama
zh_cn: 奥拉马 模型

# PullNewModel
source: Pull a new model
de: Ein neues Modell abrufen
es: Descargar un nuevo modelo
fr: Télécharger un nouveau modèle
hi: एक नया मॉडल पुल करें
ja: 新しいモデルをプル
ko: 새 모델 가져오기
pt: Baixar um novo modelo
zh_cn: 拉新模型

source: Click here
de: Klicken Sie hier
es: Haga clic aquí
fr: Cliquez ici
hi: यहां क्लिक करें
ja: ここをクリック
ko: 여기를 클릭하여
pt: Clique aqui
zh_cn: 点击这里
