Repository: view-io/personal
Catalog: src/View.Personal/Resources/Strings.*.resx
Languages: de, es, fr, hi, ja, ko, pt, zh_cn

# AnthropicMaxRetriesTooltip
source: Maximum number of retries for failed requests.
de: Maximale Anzahl von Wiederholungen für fehlgeschlagene Anfragen.
es: Número máximo de reintentos para solicitudes fallidas.
fr: Nombre maximum de tentatives pour les requêtes échouées.
hi: विफल अनुरोधों के लिए अधिकतम पुनः प्रयासों की संख्या।
ja: 失敗したリクエストの最大再試行回数。
ko: 실패한 요청에 대한 최대 재시도 횟수입니다.
pt: Número máximo de tentativas de repetição para solicitações com falha.
zh_cn: 失败请求的最大重试次数。

# AnthropicTemperatureTooltip
source: Controls randomness of the AI's responses. Higher values (e.g., 0.8) produce more creative output, while lower values (e.g., 0.2) make responses more focused and deterministic.
de: Steuert die Zufälligkeit der KI-Antworten. Höhere Werte (z. B. 0.8) erzeugen kreativere Ergebnisse, während niedrigere Werte (z. B. 0.2) die Antworten fokussierter und deterministischer machen.
es: Controla la aleatoriedad de las respuestas de la IA. Valores más altos (p.ej., 0.8) producen resultados más creativos, mientras que valores más bajos (p.ej., 0.2) hacen que las respuestas sean más enfocadas y deterministas.
fr: Contrôle le caractère aléatoire des réponses de l'IA. Des valeurs élevées (ex. : 0,8) produisent des résultats plus créatifs, tandis que des valeurs basses (ex. : 0,2) rendent les réponses plus ciblées et déterministes.
hi: एआई के उत्तरों की यादृच्छिकता को नियंत्रित करता है। उच्च मान (जैसे 0.8) अधिक रचनात्मक आउटपुट देते हैं, जबकि कम मान (जैसे 0.2) उत्तरों को अधिक केंद्रित और निर्धारक बनाते हैं।
ja: AIの応答のランダム性を制御します。高い値（例：0.8）はより創造的な出力を生成し、低い値（例：0.2）は応答をより焦点を絞った決定的なものにします。
ko: AI 응답의 무작위성을 제어합니다. 값이 높을수록(예: 0.8) 더 창의적인 결과가 생성되며, 값이 낮을수록(예: 0.2) 응답이 더 집중되고 결정적이게 됩니다.
pt: Controla a aleatoriedade das respostas da IA. Valores mais altos (ex: 0.8) produzem resultados mais criativos, enquanto valores mais baixos (ex: 0.2) tornam as respostas mais focadas e determinísticas.
zh_cn: 控制AI响应的随机性。较高的值（例如0.8）会产生更具创造性的输出，而较低的值（例如0.2）会使响应更具针对性和确定性。

# OllamaBatchSizeTooltip
source: The number of requests to process in a batch.
de: Die Anzahl der Anfragen, die in einem Stapel verarbeitet werden sollen.
es: El número de solicitudes a procesar en un lote.
fr: Le nombre de requêtes à traiter dans un lot.
hi: एक बैच में संसाधित करने के लिए अनुरोधों की संख्या।
ja: バッチで処理するリクエストの数。
ko: 배치에서 처리할 요청 수입니다.
pt: O número de solicitações a serem processadas em um lote.
zh_cn: 一批要处理的请求数。

# OllamaMaxRetriesTooltip
source: Maximum number of retries for failed requests.
de: Maximale Anzahl von Wiederholungen für fehlgeschlagene Anfragen.
es: Número máximo de reintentos para solicitudes fallidas.
fr: Nombre maximum de tentatives pour les requêtes échouées.
hi: विफल अनुरोधों के लिए अधिकतम पुनः प्रयासों की संख्या।
ja: 失敗したリクエストの最大再試行回数。
ko: 실패한 요청에 대한 최대 재시도 횟수입니다.
pt: Número máximo de tentativas de repetição para solicitações com falha.
zh_cn: 失败请求的最大重试次数。

# OllamaTemperatureTooltip
source: Controls randomness of the AI's responses. Higher values (e.g., 0.8) produce more creative output, while lower values (e.g., 0.2) make responses more focused and deterministic.
de: Steuert die Zufälligkeit der KI-Antworten. Höhere Werte (z. B. 0.8) erzeugen kreativere Ergebnisse, während niedrigere Werte (z. B. 0.2) die Antworten fokussierter und deterministischer machen.
es: Controla la aleatoriedad de las respuestas de la IA. Valores más altos (p.ej., 0.8) producen resultados más creativos, mientras que valores más bajos (p.ej., 0.2) hacen que las respuestas sean más enfocadas y deterministas.
fr: Contrôle le caractère aléatoire des réponses de l'IA. Des valeurs élevées (ex. : 0,8) produisent des résultats plus créatifs, tandis que des valeurs basses (ex. : 0,2) rendent les réponses plus ciblées et déterministes.
hi: एआई के उत्तरों की यादृच्छिकता को नियंत्रित करता है। उच्च मान (जैसे 0.8) अधिक रचनात्मक आउटपुट देते हैं, जबकि कम मान (जैसे 0.2) उत्तरों को अधिक केंद्रित और निर्धारक बनाते हैं।
ja: AIの応答のランダム性を制御します。高い値（例：0.8）はより創造的な出力を生成し、低い値（例：0.2）は応答をより焦点を絞った決定的なものにします。
ko: AI 응답의 무작위성을 제어합니다. 값이 높을수록(예: 0.8) 더 창의적인 결과가 생성되며, 값이 낮을수록(예: 0.2) 응답이 더 집중되고 결정적이게 됩니다.
pt: Controla a aleatoriedade das respostas da IA. Valores mais altos (ex: 0.8) produzem resultados mais criativos, enquanto valores mais baixos (ex: 0.2) tornam as respostas mais focadas e determinísticas.
zh_cn: 控制AI响应的随机性。较高的值（例如0.8）会产生更具创造性的输出，而较低的值（例如0.2）会使响应更具针对性和确定性。

# OllamaHostNameTooltip
source: Enter the Ollama host name or URL.
de: Geben Sie den Hostnamen oder die URL von Ollama ein.
es: Ingrese el nombre de host o la URL de Ollama.
fr: Saisissez le nom d'hôte ou l'URL d'Ollama.
hi: ओल्लामा होस्ट नाम या URL दर्ज करें।
ja: Ollamaホスト名またはURLを入力します。
ko: Ollama 호스트 이름 또는 URL을 입력하세요.
pt: Digite o nome do host ou URL do Ollama.
zh_cn: 输入 奥拉马 主机名或 URL。

# DeleteKnowledgebaseTooltip
source: Delete knowledgebase
de: Wissensdatenbank löschen
es: Eliminar base de conocimiento
fr: Supprimer la base de connaissances
hi: ज्ञान आधार हटाएं
ja: ナレッジベースを削除
ko: 지식 베이스 삭제
pt: Excluir base de conhecimento
zh_cn: 删除知识库

# ClearConsoleTooltip
source: Clear Console
de: Konsole leeren
es: Limpiar consola
fr: Effacer la console
hi: कंसोल साफ़ करें
ja: コンソールをクリア
ko: 콘솔 지우기
pt: Limpar Console
zh_cn: 清除控制台

# DownloadLogsTooltip
source: Download Logs
de: Protokolle herunterladen
es: Descargar registros
fr: Télécharger les journaux
hi: लॉग डाउनलोड करें
ja: ログをダウンロード
ko: 로그 다운로드
pt: Baixar Logs
zh_cn: 下载日志

source: Chat
fr: Discussion
hi: चैट
ja: チャット
ko: 채팅
zh_cn: 聊天

source: Japanese
de: Japanisch
es: Japonés
fr: Japonais
hi: जापानी
ja: 日本語
ko: 일본어
pt: Japonês
zh_cn: 日本人

source: View AI Enterprise
es: Ver empresa de IA
ja: AI エンタープライズを見る
ko: AI 엔터프라이즈 보기
pt: Ver IA Empresarial
zh_cn: 查看人工智能企业

# SaveLanguage
source: Save Language Setting
de: Spracheinstellung speichern
es: Guardar configuración de idioma
fr: Enregistrer le paramètre de langue
hi: भाषा सेटिंग सहेजें
ja: 言語設定を保存
ko: 언어 설정 저장
pt: Salvar Configuração de Idioma
zh_cn: 保存语言设置

# RestartRequired
source: Your language preference has been saved and applied.
de: Ihre Spracheinstellung wurde gespeichert und angewendet.
es: Su preferencia de idioma ha sido guardada y aplicada.
fr: Votre préférence de langue a été enregistrée et appliquée.
hi: आपकी भाषा प्राथमिकता सहेज ली गई है और लागू कर दी गई है।
ja: 言語設定が保存され、適用されました。
ko: 언어 설정이 저장 및 적용되었습니다.
pt: Sua preferência de idioma foi salva e aplicada.
zh_cn: 您的语言偏好已保存并应用。

# SelectLanguage
source: Select your preferred language:
de: Wählen Sie Ihre bevorzugte Sprache:
es: Seleccione su idioma preferido:
fr: Sélectionnez votre langue préférée :
hi: अपनी पसंदीदा भाषा चुनें:
ja: ご希望の言語を選択してください:
ko: 선호하는 언어를 선택하세요:
pt: Selecione seu idioma de preferência:
zh_cn: 选择您的首选语言：

source: Validation Error
de: Validierungsfehler
es: Error de validación
fr: Erreur de validation
hi: मान्यता त्रुटि
ja: 検証エラー
ko: 유효성 검사 오류
pt: Erro de Validação
zh_cn: 验证错误

source: Success
de: Erfolg
es: Éxito
fr: Succès
hi: सफलता
ja: 成功
ko: 성공
pt: Sucesso
zh_cn: 成功

source: Warning
de: Warnung
es: Advertencia
fr: Avertissement
hi: चेतावनी
ja: 警告
ko: 경고
pt: Aviso
zh_cn: 警告

source: Unexpected Error
de: Unerwarteter Fehler
es: Error inesperado
fr: Erreur inattendue
hi: अप्रत्याशित त्रुटि
ja: 予期しないエラー
ko: 예기치 않은 오류
pt: Erro Inesperado
zh_cn: 意外错误

# SettingsSavedMessage
source: Your settings have been successfully saved.
de: Ihre Einstellungen wurden erfolgreich gespeichert.
es: Su configuración se ha guardado correctamente.
fr: Vos paramètres ont été enregistrés avec succès.
hi: आपकी सेटिंग्स सफलतापूर्वक सहेज ली गई हैं।
ja: 設定は正常に保存されました。
ko: 설정이 성공적으로 저장되었습니다.
pt: Suas configurações foram salvas com sucesso.
zh_cn: 您的设置已成功保存。

# SomethingWentWrong
source: Something went wrong: {0}
de: Etwas ist schiefgelaufen: {0}
es: Algo salió mal: {0}
fr: Quelque chose s'est mal passé : {0}
hi: कुछ गलत हो गया: {0}
ja: 問題が発生しました: {0}
ko: 문제가 발생했습니다: {0}
pt: Algo deu errado: {0}
zh_cn: 出现问题：{0}

source: Unsupported file type.
de: Nicht unterstützter Dateityp.
es: Tipo de archivo no soportado.
fr: Type de fichier non pris en charge.
hi: असमर्थित फ़ाइल प्रकार।
ja: サポートされていないファイルタイプです。
ko: 지원되지 않는 파일 형식입니다.
pt: Tipo de arquivo não suportado.
zh_cn: 不支持的文件类型。

source: Resuming Ingestion
de: Setze Aufnahme fort
es: Reanudando ingesta
fr: Reprise de l'ingestion
hi: अंतर्ग्रहण फिर से शुरू हो रहा है
ja: 取り込みを再開中
ko: 수집 재개 중
pt: Retomando Ingestão
zh_cn: 恢复摄取

# ReprocessingError
source: Remove Selected Files
de: Fehler bei der Neuverarbeitung
es: Error de reprocesamiento
fr: Erreur de retraitement
hi: पुनः प्रसंस्करण त्रुटि
ja: 再処理エラー
ko: 재처리 오류
pt: Remover Arquivos Selecionados
zh_cn: 重新处理错误

source: Unreachable Host
de: Host nicht erreichbar
es: Host inaccesible
fr: Hôte inaccessible
hi: अपहुंच योग्य होस्ट
ja: 到達不能なホスト
ko: 연결할 수 없는 호스트
pt: Host Inacessível
zh_cn: 主机无法访问

# ViewEndpointFormat
source: View endpoint must be in the format: http://<hostname or IP>:<port>/
de: Der View-Endpunkt muss das Format haben: http://<Hostname oder IP>:<Port>/
es: El endpoint de View debe tener el formato: http://<hostname o=o IP=IP>:<puerto>/
fr: Le point de terminaison View doit être au format : http://<nom d'hôte=d'hôte ou=ou IP=IP>:<port>/
hi: व्यू एंडपॉइंट इस प्रारूप में होना चाहिए: http://<होस्टनेम या IP>:<पोर्ट>/
ja: Viewエンドポイントは次の形式である必要があります: http://<hostname or IP>:<port>/
ko: View 엔드포인트는 http://<호스트 이름=이름 또는=또는 IP=IP>:<포트>/ 형식이어야 합니다.
pt: O endpoint do View deve estar no formato: http://<nome do=do host=host ou=ou IP=IP>:<porta>/
zh_cn: View 端点必须采用格式：http://<主机名或 IP>:<端口>/

# SelectAtLeastOneFile
source: Please select at least one file to remove.
de: Bitte wählen Sie mindestens eine Datei zum Entfernen aus.
es: Por favor, seleccione al menos un archivo para eliminar.
fr: Veuillez sélectionner au moins un fichier à supprimer.
hi: कृपया हटाने के लिए कम से कम एक फ़ाइल का चयन करें।
ja: 削除するファイルを少なくとも1つ選択してください。
ko: 삭제할 파일을 하나 이상 선택해주세요.
pt: Por favor, selecione pelo menos um arquivo para remover.
zh_cn: 请至少选择一个文件进行删除。

source: Sync
de: Synchronisieren
es: Sincronizar
fr: Synchroniser
hi: सिंक
ja: 同期
ko: 동기화
pt: Sincronizar
zh_cn: 同步

source: VoyageAI embedding settings incomplete.
de: VoyageAI-Embedding-Einstellungen unvollständig.
es: La configuración de embeddings de VoyageAI está incompleta.
fr: Paramètres d'embedding VoyageAI incomplets.
hi: VoyageAI एम्बेडिंग सेटिंग्स अपूर्ण हैं।
ja: VoyageAI埋め込み設定が不完全です。
ko: VoyageAI 임베딩 설정이 불완전합니다.
pt: Configurações de embedding da VoyageAI incompletas.
zh_cn: VoyageAI 嵌入设置不完整。

source: View embedding settings incomplete.
de: View-Embedding-Einstellungen unvollständig.
es: La configuración de embeddings de View está incompleta.
fr: Paramètres d'embedding View incomplets.
hi: View एम्बेडिंग सेटिंग्स अपूर्ण हैं।
ja: View埋め込み設定が不完全です。
ko: View 임베딩 설정이 불완전합니다.
pt: Configurações de embedding do View incompletas.
zh_cn: View 嵌入设置不完整。

source: Welcome to View
de: Willkommen bei View
es: Bienvenido a View
fr: Bienvenue dans View
hi: व्यू में आपका स्वागत है
ja: Viewへようこそ
ko: View에 오신 것을 환영합니다
pt: Bem-vindo ao View
zh_cn: 欢迎使用 View

source: Upload Files
de: Dateien hochladen
es: Subir archivos
fr: Téléverser des fichiers
hi: फ़ाइलें अपलोड करें
ja: ファイルをアップロード
ko: 파일 업로드
pt: Carregar Arquivos
zh_cn: 上传文件

source: Select
de: Auswählen
es: Seleccionar
fr: Sélectionner
hi: चुनें
ja: 選択
ko: 선택
pt: Selecionar
zh_cn: 选择

source: Size
de: Größe
es: Tamaño
fr: Taille
hi: आकार
ja: サイズ
ko: 크기
pt: Tamanho
zh_cn: 尺寸

source: Type
de: Typ
es: Tipo
hi: प्रकार
ja: タイプ
ko: 유형
pt: Tipo
zh_cn: 类型

# ReprocessFile
source: Reprocess the file
de: Datei neu verarbeiten
es: Reprocesar el archivo
fr: Retraiter le fichier
hi: फ़ाइल को फिर से प्रोसेस करें
ja: ファイルを再処理
ko: 파일 재처리
pt: Reprocessar o arquivo
zh_cn: 重新处理文件

source: Select All
de: Alle auswählen
es: Seleccionar todo
fr: Tout sélectionner
hi: सभी चुनें
ja: すべて選択
ko: 모두 선택
pt: Selecionar Tudo
zh_cn: 选择全部

source: Remove Selected Files
de: Ausgewählte Dateien entfernen
es: Eliminar archivos seleccionados
fr: Supprimer les fichiers sélectionnés
hi: चयनित फ़ाइलें हटाएं
ja: 選択したファイルを削除
ko: 선택한 파일 제거
pt: Remover Arquivos Selecionados
zh_cn: 删除选定的文件

source: What do you want to chat about?
de: Worüber möchten Sie chatten?
es: ¿Sobre qué quieres chatear?
fr: De quoi voulez-vous discuter ?
hi: आप किस बारे में चैट करना चाहते हैं?
ja: 何についてチャットしますか？
ko: 무엇에 대해 채팅하고 싶으세요?
pt: Sobre o que você quer conversar?
zh_cn: 您想聊什么？

source: Remove
de: Entfernen
es: Eliminar
fr: Supprimer
hi: हटाएं
ja: 削除
ko: 제거
pt: Remover
zh_cn: 消除

source: YOUR_API_KEY_HERE
de: IHR_API_SCHLÜSSEL_HIER
es: SU_CLAVE_DE_API_AQUÍ
fr: VOTRE_CLÉ_API_ICI
hi: आपकी_एपीआई_कुंजी_यहां
ja: あなたのAPIキーをここに入力
ko: API_키를_여기에_입력
pt: SUA_CHAVE_DE_API_AQUI
zh_cn: 此处输入您的 API 密钥

# SpecifyOpenAIModel
source: Specify the OpenAI model to use, e.g., gpt-3.5-turbo or gpt-4.
de: Geben Sie das zu verwendende OpenAI-Modell an, z. B. gpt-3.5-turbo oder gpt-4.
es: Especifique el modelo de OpenAI a utilizar, p.ej., gpt-3.5-turbo o gpt-4.
fr: Spécifiez le modèle OpenAI à utiliser, ex. : gpt-3.5-turbo ou gpt-4.
hi: उपयोग करने के लिए ओपनएआई मॉडल निर्दिष्ट करें, जैसे, gpt-3.5-turbo या gpt-4।
ja: 使用するOpenAIモデル（例: gpt-3.5-turbo、gpt-4）を指定します。
ko: 사용할 OpenAI 모델을 지정하세요 (예: gpt-3.5-turbo 또는 gpt-4).
pt: Especifique o modelo OpenAI a ser usado, por exemplo, gpt-3.5-turbo ou gpt-4.
zh_cn: 指定要使用的 开放人工智能 模型，例如 gpt-3.5-turbo 或 gpt-4。

# SetOpenAIEndpoint
source: Set the OpenAI API endpoint.
de: Legen Sie den OpenAI-API-Endpunkt fest.
es: Establezca el endpoint de la API de OpenAI.
fr: Définissez le point de terminaison de l'API OpenAI.
hi: ओपनएआई एपीआई एंडपॉइंट सेट करें।
ja: OpenAI APIエンドポイントを設定します。
ko: OpenAI API 엔드포인트를 설정하세요.
pt: Defina o endpoint da API da OpenAI.
zh_cn: 设置 开放人工智能 应用程序编程接口 端点。

# SpecifyAnthropicModel
source: Specify the Anthropic model to use, e.g., claude-2 or claude-instant-1.
de: Geben Sie das zu verwendende Anthropic-Modell an, z. B. claude-2 oder claude-instant-1.
es: Especifique el modelo de Anthropic a utilizar, p.ej., claude-2 o claude-instant-1.
fr: Spécifiez le modèle Anthropic à utiliser, ex. : claude-2 ou claude-instant-1.
hi: उपयोग करने के लिए एंथ्रोपिक मॉडल निर्दिष्ट करें, जैसे, claude-2 या claude-instant-1।
ja: 使用するAnthropicモデル（例: claude-2、claude-instant-1）を指定します。
ko: 사용할 Anthropic 모델을 지정하세요 (예: claude-2 또는 claude-instant-1).
pt: Especifique o modelo Anthropic a ser usado, por exemplo, claude-2 ou claude-instant-1.
zh_cn: 指定要使用的人择模型，例如 claude-2 或 claude-instant-1。

# SetAnthropicEndpoint
source: Set the Anthropic API endpoint.
de: Legen Sie den Anthropic-API-Endpunkt fest.
es: Establezca el endpoint de la API de Anthropic.
fr: Définissez le point de terminaison de l'API Anthropic.
hi: एंथ्रोपिक एपीआई एंडपॉइंट सेट करें।
ja: Anthropic APIエンドポイントを設定します。
ko: Anthropic API 엔드포인트를 설정하세요.
pt: Defina o endpoint da API da Anthropic.
zh_cn: 设置 人择 API 端点。

# TemperatureTooltip
source: Controls randomness in completions. Higher values (0.8) make output more random, lower values (0.2) make it more focused.
de: Steuert die Zufälligkeit bei Vervollständigungen. Höhere Werte (0.8) machen die Ausgabe zufälliger, niedrigere Werte (0.2) machen sie fokussierter.
es: Controla la aleatoriedad en las completaciones. Valores más altos (0.8) hacen que el resultado sea más aleatorio, valores más bajos (0.2) lo hacen más enfocado.
fr: Contrôle le caractère aléatoire des complétions. Des valeurs élevées (0,8) rendent les résultats plus aléatoires, des valeurs basses (0,2) les rendent plus ciblés.
hi: पूर्णताओं में यादृच्छिकता को नियंत्रित करता है। उच्च मान (0.8) आउटपुट को अधिक यादृच्छिक बनाते हैं, निम्न मान (0.2) इसे अधिक केंद्रित बनाते हैं।
ja: 補完のランダム性を制御します。高い値（0.8）は出力をよりランダムにし、低い値（0.2）はより焦点を絞ったものにします。
ko: 완성의 무작위성을 제어합니다. 값이 높을수록(0.8) 결과가 더 무작위해지며, 값이 낮을수록(0.2) 더 집중적이게 됩니다.
pt: Controla a aleatoriedade nas conclusões. Valores mais altos (0.8) tornam o resultado mais aleatório, valores mais baixos (0.2) o tornam mais focado.
zh_cn: 控制完成的随机性。较高的值（0.8）使输出更加随机，较低的值（0.2）使输出更加集中。

source: Yes
de: Ja
es: Sí
fr: Oui
hi: हां
ja: はい
ko: 예
pt: Sim
zh_cn: 是的

source: Retry
de: Wiederholen
es: Reintentar
fr: Réessayer
hi: पुनः प्रयास करें
ja: 再試行
ko: 재시도
pt: Tentar Novamente
zh_cn: 重试

# WatchFileQuestion
source: Watch {0}? This will ingest {1} file{2}.
de: '{0}' überwachen? Dies wird {1} Datei{2} aufnehmen.
es: ¿Vigilar {0}? Esto procesará {1} archivo{2}.
fr: Surveiller {0} ? Cela ingérera {1} fichier{2}.
hi: '{0}' को वॉच करें? इससे {1} फ़ाइल{2} इंजेस्ट होगी।
ja: 「{0}」を監視しますか？これにより{1}個のファイル{2}が取り込まれます。
ko: {0}을(를) 감시하시겠습니까? 이 작업은 {1}개의 파일{2}을 처리합니다.
pt: Vigiar {0}? Isso irá ingerir {1} arquivo{2}.
zh_cn: 观看“{0}”？这将提取 {1} 个文件{2}。

source: Unwatch Only
de: Nur Überwachung beenden
es: Solo dejar de vigilar
fr: Arrêter la surveillance seulement
hi: केवल वॉच बंद करें
ja: 監視のみ停止
ko: 감시만 중지
pt: Apenas Parar de Vigiar
zh_cn: 仅限取消观看

source: Unwatch and Delete
de: Überwachung beenden und löschen
es: Dejar de vigilar y eliminar
fr: Arrêter la surveillance et supprimer
hi: वॉच बंद करें और हटाएं
ja: 監視を停止して削除
ko: 감시 중지 및 삭제
pt: Parar de Vigiar e Excluir
zh_cn: 取消关注并删除

# UnableToStartApp
source: Unable to start View Personal
de: View Personal konnte nicht gestartet werden
es: No se pudo iniciar Vista Personal
fr: Impossible de démarrer Voir Personnel
hi: व्यू पर्सनल शुरू करने में असमर्थ
ja: パーソナルを見る を起動できません
ko: 개인 Vista를 시작할 수 없습니다
pt: Não foi possível iniciar o View Personal
zh_cn: 无法启动查看个人

# StartupError
source: View Personal was unable to start due to the following exception:
de: View Personal konnte aufgrund der folgenden Ausnahme nicht gestartet werden:
es: Vista Personal no pudo iniciarse debido a la siguiente excepción:
fr: Voir Personnel n'a pas pu démarrer en raison de l'exception suivante :
hi: व्यू पर्सनल निम्नलिखित अपवाद के कारण शुरू नहीं हो सका:
ja: 次の例外のため、パーソナルを見る を起動できませんでした:
ko: 다음 예외로 인해 개인 Vista를 시작하지 못했습니다:
pt: O View Personal não pôde ser iniciado devido à seguinte exceção:
zh_cn: 由于以下异常，查看个人 无法启动：

# SpecifyOllamaModel
source: Specify the Ollama model to use, e.g., llama2-7B-q4 or mistral-7B.
de: Geben Sie das zu verwendende Ollama-Modell an, z. B. llama2-7B-q4 oder mistral-7B.
es: Especifique el modelo de Ollama a utilizar, p.ej., llama2-7B-q4 o mistral-7B.
fr: Spécifiez le modèle Ollama à utiliser, ex. : llama2-7B-q4 ou mistral-7B.
hi: उपयोग करने के लिए ओलामा मॉडल निर्दिष्ट करें, जैसे, llama2-7B-q4 या mistral-7B।
ja: 使用するOllamaモデル（例: llama2-7B-q4、mistral-7B）を指定します。
ko: 사용할 Ollama 모델을 지정하세요 (예: llama2-7B-q4 또는 mistral-7B).
pt: Especifique o modelo Ollama a ser usado, por exemplo, llama2-7B-q4 ou mistral-7B.
zh_cn: 指定要使用的 奥拉马 模型，例如 llama2-7B-q4 或 mistral-7B。

# SetOllamaEndpoint
source: Set the Ollama API endpoint.
de: Legen Sie den Ollama-API-Endpunkt fest.
es: Establezca el endpoint de la API de Ollama.
fr: Définissez le point de terminaison de l'API Ollama.
hi: ओल्लामा एपीआई एंडपॉइंट सेट करें।
ja: Ollama APIエンドポイントを設定します。
ko: Ollama API 엔드포인트를 설정하세요.
pt: Defina o endpoint da API do Ollama.
zh_cn: 设置 奥拉马 API 端点。

# SpecifyOllamaEmbeddingModelTooltip
source: Specify the Ollama embedding model to use, e.g., sentence-transformers/all-MiniLM-L6-v2.
de: Geben Sie das zu verwendende Ollama-Embedding-Modell an, z. B. sentence-transformers/all-MiniLM-L6-v2.
es: Especifique el modelo de embedding de Ollama a utilizar, p.ej., sentence-transformers/all-MiniLM-L6-v2.
fr: Spécifiez le modèle d'embedding Ollama à utiliser, ex. : sentence-transformers/all-MiniLM-L6-v2.
hi: उपयोग करने के लिए ओल्लामा एम्बेडिंग मॉडल निर्दिष्ट करें, जैसे sentence-transformers/all-MiniLM-L6-v2।
ja: 使用するOllama埋め込みモデル（例: sentence-transformers/all-MiniLM-L6-v2）を指定します。
ko: 사용할 Ollama 임베딩 모델을 지정하세요 (예: sentence-transformers/all-MiniLM-L6-v2).
pt: Especifique o modelo de embedding do Ollama a ser usado, por exemplo, sentence-transformers/all-MiniLM-L6-v2.
zh_cn: 指定要使用的 奥拉马 嵌入模型，例如 sentence-transformers/all-MiniLM-L6-v2。

# SpecifyViewEmbeddingModelTooltip
source: Specify the View embedding model to use, e.g., sentence-transformers/all-MiniLM-L6-v2.
de: Geben Sie das zu verwendende View-Embedding-Modell an, z. B. sentence-transformers/all-MiniLM-L6-v2.
es: Especifique el modelo de embedding de View a utilizar, p.ej., sentence-transformers/all-MiniLM-L6-v2.
fr: Spécifiez le modèle d'embedding View à utiliser, ex. : sentence-transformers/all-MiniLM-L6-v2.
hi: उपयोग करने के लिए व्यू एम्बेडिंग मॉडल निर्दिष्ट करें, जैसे sentence-transformers/all-MiniLM-L6-v2।
ja: 使用するView埋め込みモデル（例: sentence-transformers/all-MiniLM-L6-v2）を指定します。
ko: 사용할 View 임베딩 모델을 지정하세요 (예: sentence-transformers/all-MiniLM-L6-v2).
pt: Especifique o modelo de embedding do View a ser usado, por exemplo, sentence-transformers/all-MiniLM-L6-v2.
zh_cn: 指定要使用的视图嵌入模型，例如 sentence-transformers/all-MiniLM-L6-v2。

# SimilarityThresholdTooltip
source: Minimum similarity score required for documents to be included in the context.
de: Minimaler Ähnlichkeitswert, der erforderlich ist, damit Dokumente in den Kontext aufgenommen werden.
es: Puntuación de similitud mínima requerida para que los documentos se incluyan en el contexto.
fr: Score de similarité minimum requis pour que les documents soient inclus dans le contexte.
hi: संदर्भ में शामिल करने के लिए दस्तावेज़ों के लिए न्यूनतम समानता स्कोर।
ja: コンテキストに含めるために必要なドキュメントの最小類似度スコア。
ko: 문서가 컨텍스트에 포함되기 위해 필요한 최소 유사도 점수입니다.
pt: Pontuação mínima de similaridade necessária para que os documentos sejam incluídos no contexto.
zh_cn: 文档包含在上下文中所需的最低相似度分数。

# SetViewApiEndpoint
source: Set the View API endpoint URL.
de: Legen Sie die URL des View-API-Endpunkts fest.
es: Establezca la URL del endpoint de la API de View.
fr: Définissez l'URL du point de terminaison de l'API View.
hi: व्यू एपीआई एंडपॉइंट यूआरएल सेट करें।
ja: View APIエンドポイントURLを設定します。
ko: View API 엔드포인트 URL을 설정하세요.
pt: Defina a URL do endpoint da API do View.
zh_cn: 设置查看 API 端点 网址。

source: View Completion Model
de: View-Vervollständigungsmodell
es: Modelo de completado de View
fr: Modèle de complétion View
hi: व्यू पूर्णता मॉडल
ja: View 補完モデル
ko: View 완료 모델
pt: Modelo de Conclusão do View
zh_cn: 查看完成模型

# SpecifyViewModel
source: Specify the View model to use, e.g., llama3.1:8b.
de: Geben Sie das zu verwendende View-Modell an, z. B. llama3.1:8b.
es: Especifique el modelo de View a utilizar, p.ej., llama3.1:8b.
fr: Spécifiez le modèle View à utiliser, ex. : llama3.1:8b.
hi: उपयोग करने के लिए व्यू मॉडल निर्दिष्ट करें, जैसे, llama3.1:8b।
ja: 使用するViewモデル（例: llama3.1:8b）を指定します。
ko: 사용할 View 모델을 지정하세요 (예: llama3.1:8b).
pt: Especifique o modelo do View a ser usado, por exemplo, llama3.1:8b.
zh_cn: 指定要使用的视图模型，例如 llama3.1:8b。

source: VoyageAI embedding settings incompatible.
de: VoyageAI-Embedding-Einstellungen inkompatibel.
es: La configuración de embeddings de VoyageAI es incompatible.
fr: Paramètres d'embedding VoyageAI incompatibles.
hi: वॉयजएआई एम्बेडिंग सेटिंग्स असंगत हैं।
ja: VoyageAI埋め込み設定に互換性がありません。
ko: VoyageAI 임베딩 설정이 호환되지 않습니다.
pt: Configurações de embedding da VoyageAI incompatíveis.
zh_cn: VoyageAI 嵌入设置不兼容。

# YourApiKeyHerePlaceholder
source: YOUR_API_KEY_HERE
de: IHR_API_SCHLÜSSEL_HIER
es: SU_CLAVE_DE_API_AQUÍ
fr: VOTRE_CLÉ_API_ICI
hi: आपकी_एपीआई_कुंजी_यहां
ja: あなたのAPIキーをここに入力
ko: API_키를_여기에_입력
pt: SUA_CHAVE_DE_API_AQUI
zh_cn: 此处输入您的 API 密钥

# YourEmbeddingsApiKeyHerePlaceholder
source: YOUR_EMBEDDINGS_API_KEY
de: IHR_EMBEDDINGS_API_SCHLÜSSEL
es: SU_CLAVE_DE_API_DE_EMBEDDINGS
fr: VOTRE_CLÉ_API_D_EMBEDDINGS
hi: आपकी_एम्बेडिंग्स_एपीआई_कुंजी
ja: あなたの埋め込みAPIキー
ko: 임베딩_API_키를_여기에_입력
pt: SUA_CHAVE_DE_API_DE_EMBEDDINGS
zh_cn: 您的嵌入API密钥

# VoyageAIEmbeddingModelHeader
source: VoyageAI Embedding Model
de: VoyageAI-Embedding-Modell
es: Modelo de Embedding de VoyageAI
fr: Modèle d'embedding VoyageAI
hi: वॉयजएआई एम्बेडिंग मॉडल
ja: VoyageAI 埋め込みモデル
ko: VoyageAI 임베딩 모델
pt: Modelo de Embedding da VoyageAI
zh_cn: VoyageAI 嵌入模型
